{
  "announcements": [
    {
      "id": "1964ff1bf897639ad0f10677ed44e710ff082024",
      "title": "AWS simplifies Client VPN onboarding with Quickstart setup",
      "summary": "AWS has launched a new Quickstart setup method for AWS Client VPN that simplifies the onboarding process by reducing configuration steps. The streamlined approach uses pre-defined default configurations to make it easier for users to create and set up Client VPN endpoints. This enhancement allows for quicker deployment of secure remote connections to AWS resources and on-premises networks.",
      "category": "OTHER",
      "timestamp": "2026-01-07T20:44:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/aws-client-vpn-onboarding-quickstart-setup",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "f6cdd2cdb4fe79fc81275cc3b9cdc26f0ba98e4d",
      "title": "Amazon EC2 I7ie instances now available in additional AWS regions",
      "summary": "Amazon EC2 I7ie instances are now available in three additional AWS regions: Asia Pacific (Mumbai), Canada West (Calgary), and Europe (Paris). These instances are designed for storage-intensive workloads and are powered by 5th Gen Intel Xeon Processors, delivering up to 40% better compute performance and 20% better price performance compared to I3en instances, with up to 120TB of local NVMe storage.",
      "category": "COMPUTE",
      "timestamp": "2026-01-07T17:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-ec2-i7ie-instances-additional-aws-regions/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "167f4e69329442e0eafcae9c22b8480a82db6450",
      "title": "Announcing Apache Airflow 2.11 Support in Amazon Managed Workflows for Apache Airflow",
      "summary": "Amazon Managed Workflows for Apache Airflow (MWAA) now supports Apache Airflow version 2.11, which includes enhancements to help users prepare for the upcoming Apache Airflow 3 upgrade. The new version introduces features like trigger-based scheduling for delta intervals and other improvements to the managed orchestration service that simplifies setting up and operating data pipelines in the cloud.",
      "category": "OTHER",
      "timestamp": "2026-01-07T17:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/apache-airflow-2-11-support-amazon-managed-workflows/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "770ac59b7f073c6dc27c6daf06ae73558d12a56a",
      "title": "Amazon EC2 C8i and C8i-flex instances are now available in additional AWS regions",
      "summary": "Amazon EC2 C8i and C8i-flex instances are now available in three additional Asia Pacific regions: Mumbai, Seoul, and Tokyo. These instances are powered by custom Intel Xeon 6 processors exclusive to AWS, offering up to 15% better price-performance and 2.5x more memory bandwidth compared to previous generations.",
      "category": "COMPUTE",
      "timestamp": "2026-01-07T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-ec2-c8i-c8i-flex-instances-additional-aws-regions",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "dc23ef7d235df6ac9765ce2eb0e3fd576df6431e",
      "title": "AWS Marketplace Seller Reporting now provides collections visibility",
      "summary": "AWS Marketplace Seller Reporting now includes collection visibility, providing real-time payment collection status in the Billed Revenue Dashboard and Billing Event Data Feed. This new feature allows sellers to clearly distinguish between invoiced, collected, and disbursed amounts, eliminating the previous gap between invoice creation and payment disbursement. The enhancement enables sellers to make better business decisions and reduces the need for payment status follow-ups with customers.",
      "category": "OTHER",
      "timestamp": "2026-01-06T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/aws-marketplace-seller-reporting-collections/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "cac4f35c637008a34840b85ee2625dc810d5bd1c",
      "title": "Amazon ECS now supports tmpfs mounts on AWS Fargate and ECS Managed Instances",
      "summary": "Amazon ECS now supports tmpfs mounts for Linux tasks on AWS Fargate and ECS Managed Instances, in addition to the existing EC2 launch type support. This feature enables memory-backed temporary file systems within containers, allowing performance-sensitive workloads to access fast, temporary storage without writing data to persistent task storage.",
      "category": "SECURITY",
      "timestamp": "2026-01-06T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-ecs-tmpfs-mounts-aws-fargate-managed-instances",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "36bdedb94d7d42b7114da19b95b3ab809f570e27",
      "title": "Amazon MQ now supports HTTP based authentication for RabbitMQ brokers",
      "summary": "Amazon MQ now supports HTTP-based authentication and authorization for RabbitMQ brokers, allowing them to verify user login credentials and permissions by making requests to an HTTP server. This feature is available for RabbitMQ version 4.2 and above running on m7g instances, and can be configured through the broker's configuration file. Users can enable this functionality by simply selecting RabbitMQ 4.2 when creating a new Amazon MQ broker.",
      "category": "COMPUTE",
      "timestamp": "2026-01-06T17:35:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-mq-http-based-rabbitmq-brokers/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "7cd9086e1df9eba365491dd5c6f094aa4ea85d83",
      "title": "AWS Config now supports 21 new resource types",
      "summary": "AWS Config has expanded support to include 21 new resource types across Amazon EC2, SageMaker, and S3 Tables services. This expansion enhances monitoring coverage of AWS environments, allowing users to better discover, assess, audit, and remediate a wider range of resources. If recording is enabled for all resource types, AWS Config will automatically begin tracking these new additions.",
      "category": "SECURITY",
      "timestamp": "2026-01-06T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/aws-config-new-resource-types",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "42bce1e4670f69049d38bfe29b8feedd7d779939",
      "title": "Amazon EC2 G5 instances are now available in Asia Pacific (Hong Kong) Region",
      "summary": "Amazon EC2 G5 instances powered by NVIDIA A10G Tensor Core GPUs are now available in the Asia Pacific (Hong Kong) region. These instances support graphics-intensive applications like remote workstations, video rendering, and cloud gaming, as well as machine learning workloads that require high-performance GPU computing.",
      "category": "AI_ML",
      "timestamp": "2026-01-05T18:55:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-ec2-g5-now-available-asia-pacific-hong-kong",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "a6d2087d794463acd0ab1e2fce6ac55b715540fb",
      "title": "Happy New Year! AWS Weekly Roundup: 10,000 AIdeas Competition, Amazon EC2, Amazon ECS Managed Instances and more (January 5, 2026)",
      "summary": "This AWS Weekly Roundup welcomes 2026 and highlights several key announcements including a \"10,000 AIdeas Competition,\" updates to Amazon EC2, and new Amazon ECS Managed Instances features. The author mentions taking time off after AWS re:Invent to rest and is planning the next cohort for their \"Become a Solutions Architect (BeSA)\" program.",
      "category": "CONTAINERS",
      "timestamp": "2026-01-05T17:10:37.000Z",
      "link": "https://aws.amazon.com/blogs/aws/happy-new-year-aws-weekly-roundup-10000-aideas-competition-amazon-ec2-amazon-ecs-managed-instances-and-more-january-5-2026/",
      "source": "AWS News Blog",
      "isNew": false
    },
    {
      "id": "b71e5563721db62bda7a2916d866b0d8f7654ecb",
      "title": "AWS Resource Explorer is now available in AWS Asia Pacific (New Zealand) Region.",
      "summary": "AWS Resource Explorer is now available in the Asia Pacific (New Zealand) Region, expanding the service's global reach. This tool allows users to search for and discover AWS resources across multiple regions and accounts within their organization through various interfaces including the console, CLI, SDKs, or the unified search bar in the AWS Management Console.",
      "category": "OTHER",
      "timestamp": "2026-01-05T15:15:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/aws-resource-explorer-aws-asia-pacific-new-zealand/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "8918a3f4a50de040f63b837cca83fac9310fe2d6",
      "title": "AWS Transfer Family is now available in AWS Asia Pacific (New Zealand) region",
      "summary": "AWS Transfer Family is now available in the Asia Pacific (New Zealand) region, allowing customers to use fully managed file transfer services supporting SFTP, FTP, FTPS, and AS2 protocols. The service enables secure file transfers to Amazon S3 and Amazon EFS storage services, along with common file processing capabilities.",
      "category": "STORAGE",
      "timestamp": "2026-01-05T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/aws-transfer-family-asia-pacific-new-zealand-region",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "b3c4612aaeefa2ff34ef8bc022a2a5c689f18123",
      "title": "EC2 Capacity Manager now includes Spot interruption metrics",
      "summary": "AWS has added new Spot interruption metrics to Amazon EC2 Capacity Manager, enabling organizations to better monitor and analyze their Spot instance capacity. These metrics allow users to track running Spot instances, monitor interruption counts, and calculate interruption rates across regions, availability zones, and accounts from a centralized dashboard. This enhancement provides greater visibility into Spot capacity management alongside existing On-Demand and Capacity Reservation monitoring capabilities.",
      "category": "COMPUTE",
      "timestamp": "2026-01-05T07:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/ec2-capacity-manager-spot-interruption-metrics/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "e6b819ca1d6d24e3e9a635774a4e3f864cc91fa8",
      "title": "AWS Clean Rooms now supports detailed monitoring for collaboration queries",
      "summary": "AWS Clean Rooms has launched detailed monitoring capabilities for SQL queries within collaborations, publishing comprehensive metrics to CloudWatch. This new feature enables monitoring of query performance and resource utilization, improving observability for workloads at scale. Collaboration creators can enable this detailed monitoring to gain better operational insights into their Clean Rooms deployments.",
      "category": "OTHER",
      "timestamp": "2026-01-02T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/clean-rooms-detailed-monitoring-collaboration-queries",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "06c4c64daed2ade2202de0a5a766955633e97d7f",
      "title": "Amazon Connect now provides the capability to store nested JSON object and looping arrays",
      "summary": "Amazon Connect now supports storing and working with complex data structures like nested JSON objects and arrays directly within contact flows. This enhancement allows developers to build more dynamic automated customer experiences by saving complete data records from business systems and referencing specific elements within them. The feature also includes automatic looping capabilities for processing lists of items in customer service workflows.",
      "category": "OTHER",
      "timestamp": "2026-01-02T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-connect-nested-json-object-looping-arrays",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "4bea28a1fce11bdc03498ae5af654378e6f8b19f",
      "title": "AWS WAF is now available in the AWS Asia Pacific (New Zealand) Region",
      "summary": "AWS WAF (Web Application Firewall) is now available in the AWS Asia Pacific (New Zealand) Region. AWS WAF helps protect web applications from common exploits and bots that could impact availability, security, or resource consumption. The service allows users to control content access based on specified conditions like IP addresses and query string values.",
      "category": "SECURITY",
      "timestamp": "2025-12-30T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-waf-asia-pacific-new-zealand-region/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "d158df4fa926d5967dcae464d383630eb3858f4c",
      "title": "AWS launches simplified import of CloudTrail Lake data in Amazon CloudWatch",
      "summary": "AWS has launched a simplified way to import CloudTrail Lake data directly into Amazon CloudWatch, allowing users to consolidate historical operational, security, and compliance data in just a few steps. This enhancement enables organizations to unify data from across their AWS environment and third-party sources within CloudWatch's data management and analytics service.",
      "category": "SECURITY",
      "timestamp": "2025-12-30T14:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-simplified-import-cloudtrail-lake-data-amazon-cloudwatch",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "9b4cf6b54b82fb0e9113112330bf48aa0f100886",
      "title": "Amazon Connect dashboards now support filtering metrics based on custom business dimensions",
      "summary": "Amazon Connect dashboards now allow users to filter metrics using custom business dimensions like divisions, product lines, or customer segments through predefined attributes. This enables organizations to customize their dashboards based on specific business needs, such as comparing handle times across different product lines to identify where agents may need additional training. The feature helps businesses gain more targeted insights from their contact center data.",
      "category": "OTHER",
      "timestamp": "2025-12-29T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-connect-dashboards-filtering-metrics-custom-business-dimensions",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "54212d94c490f2375ba51c52948be5d1e3ae010a",
      "title": "Amazon OpenSearch UI supports CMK and increased metadata size",
      "summary": "Amazon OpenSearch Service now supports AWS KMS customer managed keys (CMKs) for encrypting metadata and has increased the metadata size limit for OpenSearch UI applications. This enhancement helps organizations meet regulatory compliance requirements while using the managed dashboarding service that provides unified analytics across multiple AWS data sources including OpenSearch, S3, CloudWatch, and Security Lake.",
      "category": "SECURITY",
      "timestamp": "2025-12-29T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-opensearch-ui-cmk-metadata/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "fda8408dbd1ca2772828ad24802055d797a784ca",
      "title": "Amazon Connect expands automated agent performance evaluations to 5 additional languages",
      "summary": "Amazon Connect now offers automated agent performance evaluations in five additional languages (Portuguese, French, Italian, German, and Spanish) using generative AI technology. Managers can define custom evaluation criteria in natural language and receive AI-generated assessments with explanations in their preferred language. The system also supports cross-language evaluation, allowing assessments to be completed in English even when customer conversations occur in other languages, enabling standardized evaluations across multilingual contact centers.",
      "category": "AI_ML",
      "timestamp": "2025-12-26T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-connect-automated-performance-evaluations-additional-languages/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "6b42de05eea077f0dbca0c36070fc0044613f209",
      "title": "Oracle Database@AWS is now available in three additional AWS Regions",
      "summary": "Oracle Database@AWS has expanded to three new AWS Regions: US-East-2 (Ohio), EU-Central-1 (Frankfurt), and AP-Northeast-1 (Tokyo). This service allows customers to run Oracle database workloads on Oracle Cloud Infrastructure (OCI) managed Exadata systems located within AWS data centers. The expansion particularly benefits EU and Japanese customers with data residency requirements who want to migrate their on-premises Oracle Exadata applications to AWS.",
      "category": "OTHER",
      "timestamp": "2025-12-23T18:50:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/oracle-database-aws-available-three-additional-regions/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "2a80c655e32eab2f352e567d501dc9d3348dc0ab",
      "title": "NVIDIA Nemotron 3 Nano now available on Amazon Bedrock",
      "summary": "AWS announced that NVIDIA Nemotron 3 Nano 30B A3B model is now available on Amazon Bedrock, featuring advanced capabilities including native tool calling, 256k token context window, and high reasoning performance. The model uses an efficient hybrid Mixture-of-Experts (MoE) architecture that delivers higher throughput than previous versions while maintaining the reasoning capabilities of larger models, making it particularly well-suited for agentic and coding workloads.",
      "category": "AI_ML",
      "timestamp": "2025-12-23T18:11:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/nvidia-nemotron-3-nano-amazon-bedrock",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "6dab66dc993c175e05da200aac688fbbdbb90df7",
      "title": "Amazon WorkSpaces Secure Browser now supports WebAuthn redirection for local Chromium browsers",
      "summary": "Amazon WorkSpaces Secure Browser now supports WebAuthn redirection, enabling users to authenticate to websites using local FIDO2 security keys, biometric authenticators, and platform authenticators within their secure browser sessions. This feature works with Chromium-based browsers like Google Chrome 136+ and Microsoft Edge 137+, but is not supported on non-Chromium browsers such as Safari.",
      "category": "SECURITY",
      "timestamp": "2025-12-23T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-workspaces-secure-browser-webauthn-redirection-chromium-browsers",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "d84c728b11a5c6ab55209d1539ed18e0803868dd",
      "title": "Amazon MSK expands Standard Brokers and Express Brokers to Asia Pacific (New Zealand) Region",
      "summary": "Amazon Managed Streaming for Apache Kafka (Amazon MSK) has expanded its availability to the Asia Pacific (New Zealand) region, allowing customers to create MSK Provisioned clusters there starting immediately. Amazon MSK is a fully managed service that simplifies building and running Apache Kafka applications while maintaining full compatibility with existing Apache Kafka workloads for easier migration.",
      "category": "ANALYTICS",
      "timestamp": "2025-12-23T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-msk-additional-aws-region/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "8df176efef6b49bd92273593fdbe76f811011aba",
      "title": "Amazon RDS for MySQL announces Innovation Release 9.5 in Amazon RDS Database Preview Environment",
      "summary": "Amazon RDS for MySQL now supports community MySQL Innovation Release 9.5 in the Amazon RDS Database Preview Environment. This allows users to evaluate the latest MySQL innovation features while benefiting from a fully managed database service that simplifies setup, operation, and monitoring. MySQL 9.5 represents the latest innovation release from the MySQL community with various improvements and bug fixes.",
      "category": "SECURITY",
      "timestamp": "2025-12-23T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-rds-mysql-innovation-release/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "b0d5712d4e391490014eb059874aaf7bf41c1ee6",
      "title": "AWS Secrets Manager announces improved secret sorting capabilities",
      "summary": "AWS Secrets Manager has expanded its sorting capabilities, allowing users to sort secrets by name, last changed date, last accessed date, and creation date (previously only creation date was available). This enhancement is available in both the Secrets Manager console and the ListSecrets API. The improvement provides better secret management and organization within AWS's fully managed service for handling database credentials, API keys, and other sensitive information.",
      "category": "SECURITY",
      "timestamp": "2025-12-23T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-secrets-manager-secret-sorting-capabilities",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "faaa7170f242652a743169bee0753982d0626fe6",
      "title": "MiniMax-M2 is now available on Amazon SageMaker JumpStart",
      "summary": "AWS has made MiniMax-M2, an efficient open-source AI model, available on Amazon SageMaker JumpStart for quick deployment within minutes. The model is a compact Mixture of Experts (MoE) architecture with 230 billion total parameters but only 10 billion active parameters, designed to be fast and cost-effective for AI agents. Users can deploy MiniMax-M2 through either SageMaker Studio's interface or the SageMaker Python SDK.",
      "category": "AI_ML",
      "timestamp": "2025-12-23T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/minimax-m2-on-sagemaker-jumpstart",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "5b4c5ef6bd05bb28cf352863e38f578f5edfda34",
      "title": "AWS Transform enables network conversion for hybrid data center migrations",
      "summary": "AWS Transform now offers automatic network conversion capabilities for hybrid data center migrations, eliminating the need for manual network mapping in environments with both VMware and non-VMware workloads. The service automatically analyzes VLANs and IP ranges from source networks and maps them to corresponding AWS infrastructure like VPCs, subnets, and security groups. This enhancement is part of AWS Transform for VMware, an AI-powered service that automates VMware workload discovery, planning, and migration processes.",
      "category": "SECURITY",
      "timestamp": "2025-12-23T12:47:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-transform-hybrid-network-migration/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "740f1fdb564ca424cacddfa1ee83a0fca0b12d7d",
      "title": "Amazon WorkSpaces Secure Browser enables branding customization",
      "summary": "Amazon WorkSpaces Secure Browser now allows organizations to customize branding on sign-in and session loading screens to maintain consistent visual identity. Users can upload their organization's logos, modify visual elements, and customize text content across all user touchpoints. This feature helps create a branded experience that aligns with company branding standards.",
      "category": "AI_ML",
      "timestamp": "2025-12-23T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-workspaces-secure-browser-enables-branding/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "797f84a3adaf61451b22e3c2b9bf8205ef947f1a",
      "title": "Amazon Redshift supports four new materialized view (MV) features on data shares",
      "summary": "Amazon Redshift has introduced four new materialized view (MV) features for data shares, enabling users to run create and refresh MV commands across multiple data warehouses and create MVs on shared MVs. The update also adds concurrency scaling support for the create MV DDL command, allowing it to scale automatically when the main cluster or workgroup runs out of resources.",
      "category": "DATABASE",
      "timestamp": "2025-12-23T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-redshift-mv-datasharing-features",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "c13da2036b64061eaf47475d640faab122cc35b8",
      "title": "AWS Deadline Cloud now supports direct job submission from the Deadline Cloud Monitor",
      "summary": "AWS Deadline Cloud has added direct job submission capabilities to its Monitor desktop application, eliminating the previous requirement to use the command line interface. This new feature expands compatibility with content creation tools that lack built-in Deadline Cloud plugins and makes it easier to submit rendering jobs directly through the desktop interface.",
      "category": "OTHER",
      "timestamp": "2025-12-22T22:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-deadline-cloud-direct-job-submission-from/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "0ddf3341ab08d389dc8cf78d8fd7d3971658b6da",
      "title": "Oracle Database@AWS now supports sharing of AWS Marketplace entitlements across accounts",
      "summary": "Oracle Database@AWS now allows customers to share AWS Marketplace entitlements across multiple accounts within an AWS Organization. This means organizations can purchase a single Oracle Database@AWS marketplace offer in one account and use it across all their AWS accounts within the organization. The feature simplifies license management and enables centralized purchasing while allowing distributed consumption of Oracle database services.",
      "category": "OTHER",
      "timestamp": "2025-12-22T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/oracle-database-aws-marketplace-entitlements-across-accounts/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "f6f04e27d7bdbd0d1d42cdc153799e6305dda971",
      "title": "Amazon ECS Service Connect enhances observability with Envoy Access Logs",
      "summary": "Amazon ECS Service Connect now supports Envoy access logs, enabling deeper observability into request-level traffic patterns and service interactions within containerized applications. This enhancement provides detailed per-request telemetry that helps with end-to-end tracing, debugging, and compliance monitoring. The feature builds on Service Connect's existing capabilities for secure, resilient service-to-service communication across clusters, VPCs, and AWS accounts.",
      "category": "CONTAINERS",
      "timestamp": "2025-12-22T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-ecs-service-connect-observability-envoy-access-logs",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "0eab103ffedb4f691729a5b283a0b4e45aa0c09c",
      "title": "Amazon Kinesis Video Streams now supports IPv6 for WebRTC",
      "summary": "Amazon Kinesis Video Streams now supports IPv6 addressing for WebRTC through dual-stack endpoint support, allowing developers to use both IPv4 and IPv6 addresses for video streaming from millions of devices. This update ensures existing IPv4 implementations continue working reliably while providing IPv6 connectivity benefits and simplifying the transition to IPv6 addresses.",
      "category": "ANALYTICS",
      "timestamp": "2025-12-22T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-kinesis-video-streams-webrtc-ipv6/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "2167f8531aa9f0e459b1cfe377fd6bc1c3b020eb",
      "title": "Amazon GameLift Streams launches real-time performance stats and improved API error messaging ",
      "summary": "Amazon GameLift Streams has launched new observability features that provide real-time performance statistics for individual streaming sessions, giving developers detailed insights into application performance issues. The update addresses developer requests for better visibility into session performance and resource utilization across different stream classes and GPUs. These enhanced stats enable developers to make more informed decisions about optimal GPU selection for their applications.",
      "category": "OTHER",
      "timestamp": "2025-12-22T17:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-gameliftstream-performance-stats-error-messaging",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "0b0758b8e67021bbe6d923c181b2944b5511a98f",
      "title": "Amazon GameLift Streams launches Gen6-based stream classes and enhanced autoscaling for better performance and pricing",
      "summary": "Amazon GameLift Streams has introduced Gen6 stream classes based on EC2 G6 instances with NVIDIA L4 Tensor Core GPUs, delivering up to 2x better performance than Gen4 classes. The update also includes enhanced autoscaling with warm buffer capabilities, allowing customers to dynamically manage capacity scaling for optimized performance and cost-effectiveness.",
      "category": "OTHER",
      "timestamp": "2025-12-22T17:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-gameliftstream-gen6-enhanced-autoscaling",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "be31bbccf68b0bd4b2da096477af3fcd9c5fdcf9",
      "title": "Research and Engineering Studio on AWS Version 2025.12 now available",
      "summary": "AWS has released Research and Engineering Studio (RES) version 2025.12, an open source web-based portal that helps administrators create and manage secure cloud-based research and engineering environments. The new version introduces key improvements including tag propagation for CloudFormation resources, enhanced Windows domain configuration options, default session scheduling, and security enhancements.",
      "category": "SECURITY",
      "timestamp": "2025-12-22T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/research-engineering-studio-aws-new-version-available/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "647276de59971a5e3453cc9eb10e175b338c9d56",
      "title": "AWS Storage Gateway now supports Nutanix AHV hypervisor",
      "summary": "AWS Storage Gateway now supports deployment on the Nutanix AHV hypervisor, enabling organizations using Nutanix's KVM-based virtualization platform to deploy S3 File, Tape, and Volume gateways in their on-premises environments. This integration allows Nutanix AHV users to seamlessly access AWS's virtually unlimited cloud storage through their existing hyper-converged infrastructure.",
      "category": "COMPUTE",
      "timestamp": "2025-12-22T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-storage-gateway-nutanix-avh-hypervisor",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "8aeeb5084a461014b2a796164dab25fcd1dcd937",
      "title": "AWS Wickr launches admin APIs for programmatic network management at scale",
      "summary": "AWS Wickr has launched a suite of admin APIs that enable administrators to programmatically manage secure communication networks at scale. These APIs automate critical administrative workflows including user lifecycle management (creating/deactivating accounts and assigning security groups) and network configuration. The new functionality allows organizations to streamline administrative tasks and manage their Wickr networks more efficiently through automated processes.",
      "category": "SECURITY",
      "timestamp": "2025-12-22T08:00:00.000Z",
      "link": "https://aws.amazon.comabout-aws/whats-new/2025/12/aws-wickr-admin-apis-generally-available/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "3a26dbbc2f1911d4313298f075f221136a4c0821",
      "title": "Announcing AWS Neuron SDK 2.27.0",
      "summary": "AWS has released Neuron SDK 2.27.0, which adds support for Trainium3 UltraServer and includes several new tools and features with expanded open source components. Key additions include the Neuron Explorer tools suite, Enhanced NKI with an open source compiler, native PyTorch support through TorchNeuron, and Kubernetes-native resource management via Neuron DRA. These updates are designed to enable standard machine learning frameworks to run seamlessly on AWS Trainium infrastructure without requiring code changes.",
      "category": "AI_ML",
      "timestamp": "2025-12-22T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/announcing-aws-neuron-2-27",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "8ef7726ca3407bdab01ad968389d236778419e5d",
      "title": "Amazon Application Recovery Controller region switch now supports three new capabilities",
      "summary": "Amazon Application Recovery Controller (ARC) Region switch has added three new capabilities to help orchestrate multi-Region application failovers to another AWS Region during regional impairments. The service provides bounded recovery times while eliminating hours of manual engineering work previously required for failover procedures. It automates failover steps, dashboard creation, and evidence gathering for successful recovery operations.",
      "category": "DATABASE",
      "timestamp": "2025-12-19T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-application-recovery-controller-region-switch-new-capabilities",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "f364e0aebd16d9e48a709eb2a5af118bd5167686",
      "title": "AWS Private CA OCSP now available in China and AWS GovCloud (US) Regions",
      "summary": "AWS Private Certificate Authority (AWS Private CA) has expanded its Online Certificate Status Protocol (OCSP) support to China and AWS GovCloud (US) Regions. This enhancement allows real-time certificate validation and revocation status checking for applications using private certificates in these regions. AWS Private CA is a fully managed service that eliminates the operational complexity of maintaining your own certificate authority infrastructure.",
      "category": "SECURITY",
      "timestamp": "2025-12-19T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-private-ca-ocsp-china-govcloud-us-regions",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "08c5ac89a4a95c100e9eb9a2225ba25f175afd10",
      "title": "Amazon SageMaker Studio now supports SOCI indexing for faster container startup times",
      "summary": "Amazon SageMaker Studio now supports SOCI (Seekable Open Container Initiative) indexing, which reduces container startup times by 30-50% when using custom images. This enhancement improves the performance of SageMaker Studio, AWS's browser-based machine learning development environment that provides pre-built containers for popular ML frameworks like TensorFlow, PyTorch, and Scikit-learn.",
      "category": "AI_ML",
      "timestamp": "2025-12-19T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-sagemaker-nbi-soci/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "27a23143259aea74e95a84a3f57b835dde0bf31a",
      "title": "Amazon RDS enhances observability for snapshot exports to Amazon S3",
      "summary": "Amazon RDS has introduced enhanced observability features for snapshot exports to Amazon S3, providing detailed insights into export progress, failures, and performance through four new event types. These improvements allow users to monitor their snapshot exports with greater granularity and predictability. The feature enables exporting RDS database snapshots to Apache Parquet format in S3 buckets with better visibility into the export process.",
      "category": "DATABASE",
      "timestamp": "2025-12-19T14:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-rds-observability-snapshot-exports-s3",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "b1db203d963db2fddcf4d3e6f5be46682b28116a",
      "title": "Amazon Bedrock Data Automation launches instruction optimization for your document blueprints",
      "summary": "Amazon Bedrock Data Automation (BDA) has launched blueprint instruction optimization, which automatically improves the accuracy of custom field extraction from documents using example assets with ground truth labels. This feature refines natural language instructions in blueprints to better extract insights from unstructured multimodal content including documents, images, audio, and videos. The enhancement helps optimize GenAI-powered applications by automatically improving extraction performance with minimal manual intervention.",
      "category": "AI_ML",
      "timestamp": "2025-12-19T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/bedrock-data-automation-optimization-document-blueprints/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "64692cc659f7616ec9fcdbb52ee23551a3d6eb22",
      "title": "Timestream for InfluxDB Now Supports Restart API Calls",
      "summary": "Amazon Timestream for InfluxDB now supports a restart API for both InfluxDB versions 2 and 3, allowing customers to trigger system restarts on their database instances through the AWS Management Console, API, or CLI. This new feature enables customers to perform resilience testing and address health-related issues more efficiently, streamlining operational management of their time-series database environments.",
      "category": "DATABASE",
      "timestamp": "2025-12-19T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/timestream-influxdb-restart-api",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "deb1d19b403cb1186fd4ba17da7b0eff920ffcb1",
      "title": "Announcing Cost Allocation Tags support for Account Tags",
      "summary": "AWS has announced support for Cost Allocation Tags with account tags, allowing customers with multiple member accounts to use their existing AWS Organizations account tags directly in cost management tools. Account tags are automatically applied at the account level and cover all metered usage within tagged accounts, removing the need to manually configure separate account groupings in AWS Cost Explorer and Cost and Usage Reports. This enhancement streamlines cost management across multi-account AWS environments.",
      "category": "OTHER",
      "timestamp": "2025-12-19T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/cost-allocation-tags/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "6b9bdcdc95d0b7c1db2e9f7ee15c2ed6a7a61826",
      "title": "Amazon ECR now supports creating repositories on push",
      "summary": "Amazon Elastic Container Registry (ECR) now automatically creates repositories when container images are pushed, eliminating the need for users to manually pre-create repositories. This feature streamlines container workflows by using defined repository creation template settings to automatically generate repositories as needed. The capability is available across all AWS regions where ECR is offered.",
      "category": "CONTAINERS",
      "timestamp": "2025-12-19T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-ecr-creating-repositories-on-push/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "15824a9b568044554d1846e29e16b225128220b2",
      "title": "AWS IoT now offers event-based logging to help optimize observability costs",
      "summary": "AWS IoT has introduced event-based logging, a new feature that allows developers to reduce Amazon CloudWatch costs while improving log management efficiency. This capability enables customizable log levels and destinations for individual IoT events based on their operational importance. For example, developers can set different log levels (like INFO-level) for specific event types such as certificate providers.",
      "category": "OTHER",
      "timestamp": "2025-12-19T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-iot-event-based-logging/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "b4bad7fdb7a4b1da2ce4d7f522a4777df7de9e32",
      "title": "Amazon WorkSpaces Applications now supports Microsoft Windows Server 2025",
      "summary": "Amazon WorkSpaces Applications now supports Microsoft Windows Server 2025, allowing customers to launch streaming instances with the latest server operating system features. This update provides improved security, performance, and modern capabilities for application streaming environments. The new support enables delivery of the Windows 11 desktop experience to end users with enhanced flexibility.",
      "category": "SECURITY",
      "timestamp": "2025-12-19T08:00:00.000Z",
      "link": "https://aws.amazon.comabout-aws/whats-new/2025/12/amazon-workspaces-applications-supports-microsoft-windows-server",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "a8e2f475b97552d6a1fde2c130fed82fc391daf5",
      "title": "Amazon EC2 now supports Availability Zone ID across its APIs",
      "summary": "Amazon EC2 now supports Availability Zone ID (AZ ID) parameters across its APIs, allowing users to create and manage resources using consistent zone identifiers that represent the same physical location across all AWS accounts. This replaces the previous system where AZ names could map to different physical locations, making resource placement optimization more reliable and predictable.",
      "category": "COMPUTE",
      "timestamp": "2025-12-18T20:55:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-ec2-az-id-api-support",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "e6ccdfc10fb11a4aa8399e348fdd388ff6aaa00c",
      "title": "Amazon WorkSpaces Applications announces Elastic fleets powered by Ubuntu Pro 24.04 LTS",
      "summary": "Amazon WorkSpaces Applications now supports Ubuntu Pro 24.04 LTS on Elastic fleets, allowing ISVs and IT organizations to stream Ubuntu desktop applications to users through AWS Cloud infrastructure. This fully managed service enables secure, flexible access to desktops and applications from anywhere while providing scalability and cost-effectiveness.",
      "category": "OTHER",
      "timestamp": "2025-12-18T16:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-workspaces-ubuntu-elasticfleets",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "f07a6fcd9cc1114bccf14be763dd4aab0a35f84d",
      "title": "Amazon EC2 C8a instances now available in the Europe (Spain) region",
      "summary": "Amazon EC2 C8a instances, powered by 5th Gen AMD EPYC processors with up to 4.5 GHz frequency, are now available in the Europe (Spain) region. These compute-optimized instances deliver up to 30% higher performance and 19% better price-performance compared to C7a instances, with 33% more memory bandwidth making them ideal for latency-sensitive workloads.",
      "category": "COMPUTE",
      "timestamp": "2025-12-18T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-ec2-c8a-instances-europe-spain-region",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "3a9ca41506f48af04027b3a629304cf68d95ca59",
      "title": "Amazon WorkSpaces now supports IPv6",
      "summary": "Amazon WorkSpaces now supports IPv6 connectivity through a dual-stack IPv4/IPv6 configuration, allowing users to connect from compatible clients (except when using SAML authentication). This update helps customers meet IPv6 compliance requirements and reduces costs by eliminating the need for expensive networking equipment to translate between IPv4 and IPv6 addresses.",
      "category": "OTHER",
      "timestamp": "2025-12-18T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-workspaces-ipv6/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "674e22734d0d6265d44116fc72f747860a039d43",
      "title": "Amazon MSK Connect now supports dual-stack (IPv4 and IPv6) connectivity for new connectors",
      "summary": "Amazon MSK Connect now supports dual-stack connectivity, allowing customers to create new connectors that use both IPv4 and IPv6 protocols simultaneously, in addition to the existing IPv4-only option. This enhancement helps organizations modernize their applications for IPv6 environments while maintaining backward compatibility with IPv4, facilitating compliance requirements and preparation for future network architectures.",
      "category": "ANALYTICS",
      "timestamp": "2025-12-18T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-msk-connect-dual-stack-ipv-and-ipv/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "1a6551300d9086ca66dd6d4c4b08690a0bb863d9",
      "title": "AWS IoT Core adds message batching to HTTP rule action",
      "summary": "AWS IoT Core has introduced message batching functionality for HTTP rule actions, allowing multiple IoT messages to be combined into a single HTTP request before being sent to downstream endpoints. This new feature reduces both cost and throughput overhead when processing telemetry data from IoT workloads by minimizing the number of individual HTTP calls required.",
      "category": "OTHER",
      "timestamp": "2025-12-18T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-iot-core-message-batching-http-rule-action",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "6e10f59cf6c19a420643be74d3aa5a7eec22abcf",
      "title": "Amazon ECS Managed Instances now supports Amazon EC2 Spot Instances",
      "summary": "Amazon ECS Managed Instances now supports EC2 Spot Instances, allowing users to access spare EC2 capacity at up to 90% discount compared to On-Demand pricing for fault-tolerant workloads. This enhancement maintains AWS's fully managed infrastructure approach while providing significant cost savings through automatic scaling and infrastructure management.",
      "category": "CONTAINERS",
      "timestamp": "2025-12-18T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-ecs-managed-instances-ec2-spot-instances",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "ac5f30808ef878536268ffed26474cabfc2d8ef6",
      "title": "Amazon EC2 R8i and R8i-flex instances are now available in additional AWS regions",
      "summary": "Amazon EC2 R8i and R8i-flex instances are now available in three additional AWS regions: Asia Pacific (Seoul), South America (Sao Paulo), and Asia Pacific (Tokyo). These instances are powered by custom Intel Xeon 6 processors exclusive to AWS, offering up to 15% better price-performance and 2.5x more memory bandwidth compared to previous generations.",
      "category": "COMPUTE",
      "timestamp": "2025-12-18T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/ec2-r8i-r8i-flex-instances-additional-regions/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "b83f87b05b92720f4555696690fee9dc926a3301",
      "title": "AWS Direct Connect now supports resilience testing with AWS Fault Injection Service",
      "summary": "AWS Direct Connect now integrates with AWS Fault Injection Service (FIS) to enable controlled resilience testing of applications. This new capability allows users to simulate disruptions to Border Gateway Protocol (BGP) sessions over Virtual Interfaces and observe how their applications respond. The integration helps validate resilience mechanisms and improve application performance and observability through controlled fault injection experiments.",
      "category": "NETWORKING",
      "timestamp": "2025-12-18T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/direct-connect-resilience-testing-fault-injection-service/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "d701fd9d7ee861857d4893afc11d890d2becf24a",
      "title": "AWS Lambda durable functions are now available in 14 additional AWS Regions",
      "summary": "AWS Lambda durable functions, which allow developers to build reliable multi-step applications and AI workflows, are now available in 14 additional AWS Regions. The expansion includes major regions across the US, Europe, and Asia Pacific, such as US East (N. Virginia), Europe (Ireland), Asia Pacific (Tokyo), and Asia Pacific (Singapore). This broader availability gives developers more geographic options for deploying complex, stateful serverless applications using Lambda's familiar development environment.",
      "category": "SERVERLESS",
      "timestamp": "2025-12-18T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/lambda-durable-functions-14-additional-regions/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "c5d0dfdcb8c8a03f39e7f553f3cb5f946a5bbe48",
      "title": "Amazon Neptune Database is now available in the AWS Europe (Zurich) Region",
      "summary": "Amazon Neptune Database, AWS's fully managed graph database service, is now available in the Europe (Zurich) Region with engine versions 1.4.5.0 and later. Users can create Neptune clusters in this region using various instance types including R5, R5d, R6g, R6i, X2iedn, T4g, and T3. Neptune enables easy development of applications with highly connected datasets using Apache TinkerPop Gremlin or openCypher query languages.",
      "category": "DATABASE",
      "timestamp": "2025-12-18T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-neptune-zurich-region",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "aa5c065dd6d64bf0a5912241247a3e3ad1f23158",
      "title": "Amazon MSK introduces KRaft support for Express Brokers with Apache Kafka v3.9",
      "summary": "Amazon MSK now supports Apache Kafka version 3.9 for Express Brokers, introducing KRaft (Kafka Raft) support that eliminates the need for Apache ZooKeeper for metadata management. KRaft moves metadata management from external ZooKeeper nodes to internal Kafka controllers, allowing metadata to be stored and replicated as topics within the Kafka brokers themselves.",
      "category": "ANALYTICS",
      "timestamp": "2025-12-18T08:00:00.000Z",
      "link": "https://aws.amazon.comabout-aws/whats-new/2025/12/aws-msk-express-brokers-support-kraft/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "a650ac43305983a4051eb34a1146d22c2046ef3e",
      "title": "Amazon WorkSpaces Applications announces additional health and performance metrics",
      "summary": "Amazon WorkSpaces Applications has introduced new Amazon CloudWatch metrics that allow administrators to monitor the health and performance of fleets, sessions, instances, and users. These metrics can be easily enabled from the CloudWatch console and provide real-time updates to simplify troubleshooting. The new monitoring capabilities help administrators make better decisions about sizing and optimize end-user streaming performance.",
      "category": "COMPUTE",
      "timestamp": "2025-12-17T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-workspaces-applications-health-performance-metrics",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "2c0e8beddaf11091630ec57ca0067cc556ae7a4c",
      "title": "AWS Databases are now available on the Vercel Marketplace",
      "summary": "AWS has made three of its database servicesAmazon Aurora PostgreSQL, Amazon Aurora DSQL, and Amazon DynamoDBgenerally available on the Vercel Marketplace, allowing developers to create and connect to AWS databases directly from Vercel in seconds. New users can create an AWS account through Vercel and receive $100 USD in credits that can be used with any of these database options for up to six months.",
      "category": "SECURITY",
      "timestamp": "2025-12-17T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-databases-are-available-on-the-vercel/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "b709f05943046f9ecbf4fe02cb06335409836d0b",
      "title": "Now generally available: Amazon EC2 M8gn and M8gb instances",
      "summary": "AWS has announced the general availability of Amazon EC2 M8gn and M8gb instances powered by AWS Graviton4 processors, which deliver up to 30% better compute performance than Graviton3 processors. The M8gn instances feature 6th generation AWS Nitro Cards and offer up to 600 Gbps network bandwidth (the highest among network-optimized EC2 instances), while M8gb instances provide up to 150 Gbps of EBS bandwidth for enhanced storage performance.",
      "category": "COMPUTE",
      "timestamp": "2025-12-17T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/generally-available-amazon-ec2-m8gn-m8gb-instances",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "7fbdb3f01a4f4f0465b3ebb7330a329db09a3ce7",
      "title": "Amazon Aurora now supports PostgreSQL 18.1 in the Amazon RDS Database preview environment ",
      "summary": "Amazon Aurora PostgreSQL-Compatible Edition now supports PostgreSQL version 18.1 in the Amazon RDS Database Preview Environment, enabling users to evaluate the latest PostgreSQL features on Aurora. PostgreSQL 18.1 introduces performance improvements including \"skip scan\" support for multicolumn B-tree indexes, enhanced WHERE clause handling for OR and IN conditions, and parallel GIN index builds.",
      "category": "SECURITY",
      "timestamp": "2025-12-17T17:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-aurora-postgresql-18-1-rds-database-preview",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "7e4119e1de10b1e1364a2b4c2580a95d7289a608",
      "title": "AWS announces enhanced custom line item controls for AWS Billing Conductor",
      "summary": "AWS Billing Conductor now offers enhanced custom line item controls that allow customers to create service-specific line items scoped to one or multiple AWS services. These line items can be customized in how they appear across billing artifacts like Bills Page, Cost Explorer, and Cost and Usage Records. The improvements enable more precise and tailored charge-back and re-billing strategies for customers.",
      "category": "OTHER",
      "timestamp": "2025-12-17T16:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/enhanced-custom-line-item-controls-aws-billing-conductor",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "b38ff137a706255112f976903a58b85cb232fe7a",
      "title": "Amazon EC2 C8g, M8g, R8g instances now available in additional regions",
      "summary": "Amazon EC2 C8g, M8g, and R8g instances powered by AWS Graviton4 processors are now available in AWS GovCloud regions (US-West and US-East). These instances deliver up to 30% better performance compared to Graviton3-based instances and are built on the AWS Nitro System for enhanced performance through dedicated hardware offloading.",
      "category": "SECURITY",
      "timestamp": "2025-12-17T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-ec2-c8g-m8g-r8g-instances-additional-regions",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "1b1bd64f2b1f80cb7976f5db297d16b8830491fb",
      "title": "Amazon ECR Public now supports PrivateLink for US East (N. Virginia) SDK Endpoint",
      "summary": "Amazon ECR Public now supports AWS PrivateLink for its US East (N. Virginia) SDK endpoint, enabling customers to access the service through private network connections instead of the public internet. This enhancement allows users to establish secure, private connectivity from their Amazon VPC to the ECR Public SDK endpoint, improving network security and reducing public internet exposure.",
      "category": "SECURITY",
      "timestamp": "2025-12-17T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-ecr-public-privatelink-us-east-n-virginia-sdk-endpoint",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "3171085d34f21ebc5916e03fb3e4acd8f1bbf30f",
      "title": "EC2 Auto Scaling now offers a synchronous API to launch instances inside an Auto Scaling group",
      "summary": "AWS has launched a new synchronous API called LaunchInstances for EC2 Auto Scaling that gives customers more direct control over instance provisioning within Auto Scaling groups. The API provides immediate feedback on capacity availability, offering greater flexibility compared to the traditional automated scaling approach. This enhancement allows for more precise control over when and how instances are launched while still leveraging Auto Scaling's fleet management capabilities.",
      "category": "OTHER",
      "timestamp": "2025-12-17T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/ec2-auto-scaling-synchronous-api-launch-instances-auto-scaling-group",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "323d4af14d16050ac76d1adc7917c15057acf90c",
      "title": "Amazon EC2 C8g instances now available in Europe (Zurich)",
      "summary": "Amazon EC2 C8g instances, powered by AWS Graviton4 processors, are now available in the AWS Europe (Zurich) region. These instances deliver up to 30% better performance compared to Graviton3-based instances and are optimized for compute-intensive workloads including HPC, batch processing, gaming, video encoding, scientific modeling, distributed analytics, and CPU-based ML inference.",
      "category": "SECURITY",
      "timestamp": "2025-12-17T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-ec2-c8g-instances-europe-zurich",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "70eda0c8bba1d7210422500e7ee9c7e53ba4248a",
      "title": "Amazon OpenSearch Service announces new OI2 instances",
      "summary": "Amazon OpenSearch Service has launched new OI2 instances that are specifically optimized for higher indexing throughput, delivering up to 9% better performance compared to OR2 instances and up to 33% improvement over I8g instances. These new instances use the same architecture as OR2 instances and leverage Amazon S3 for high durability while providing improved price-performance for indexing workloads.",
      "category": "COMPUTE",
      "timestamp": "2025-12-17T14:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-opensearch-service-oi2-instances/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "7cd21ebebf7ae3b45e48510300cc1f7d6af634a2",
      "title": "AWS Payment Cryptography reduces API pricing by up to 63% and introduces tiered key pricing",
      "summary": "AWS Payment Cryptography has announced significant price reductions of up to 63% for API requests across existing tiers, while introducing a new fourth tier and unified pricing across all regions. The service has also transitioned from flat-rate to tiered key pricing to better support customers managing high volumes of cryptographic keys. These changes are designed to make it more cost-effective for customers to migrate higher volume workloads to the service.",
      "category": "SECURITY",
      "timestamp": "2025-12-17T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-payment-cryptography-lower-pricing/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "effde40fdda484e3280983ede455f754ad0b72a9",
      "title": "AWS IoT Device Management Commands now supports dynamic payloads",
      "summary": "AWS IoT Device Management commands now support dynamic payloads, allowing developers to create reusable command templates with placeholders that can be populated with different values at runtime. The update includes parameter validation rules to ensure values meet specified criteria before execution. This enhancement makes command reuse more efficient by enabling runtime parameter configuration rather than requiring separate commands for different scenarios.",
      "category": "OTHER",
      "timestamp": "2025-12-16T20:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-iot-device-management-commands-dynamic-payload/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "fdcd36bd056b33a3e14dc6720658e6f626d954f1",
      "title": "Amazon Connect launches additional details within real-time metric alerts",
      "summary": "Amazon Connect has enhanced its real-time metric alerts to include specific details about which agents, queues, flows, or routing profiles triggered the alert thresholds. This improvement allows managers to quickly identify and respond to customer experience and operational issues without having to manually investigate the root cause. For example, when queue wait times are elevated, managers can now see exactly which queues are affected and take immediate action like reassigning agents.",
      "category": "SERVERLESS",
      "timestamp": "2025-12-16T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-connect-additional-details-real-time-metric-alerts/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "ea0cac0a5b1a52ce5339d229ee5503faf93329ce",
      "title": "AWS Direct Connect announces new location in Hanoi, Vietnam",
      "summary": "AWS has opened its first Direct Connect location in Vietnam at CMC Tower in Hanoi, enabling private network connections to AWS Regions worldwide (excluding China), GovCloud Regions, and Local Zones. The facility offers dedicated connections at 1 Gbps, 10 Gbps, and 100 Gbps speeds, with MACsec encryption available for the higher-speed tiers.",
      "category": "COMPUTE",
      "timestamp": "2025-12-16T17:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-direct-connect-hanoi/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "ae246e694201c137c7d9fb8ec430e399c3b59c73",
      "title": "Amazon EC2 M8i instances are now available in additional Regions",
      "summary": "Amazon EC2 M8i instances are now available in five additional regions: Asia Pacific (Seoul, Tokyo, Sydney, Singapore) and Canada (Central). These instances feature custom Intel Xeon 6 processors exclusive to AWS, offering up to 15% better price-performance and 2.5x more memory bandwidth compared to previous generation Intel processors.",
      "category": "COMPUTE",
      "timestamp": "2025-12-16T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-ec2-m8i-instances-additional-regions",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "373318b099bf35e2cebb913b5f3a639711f083c3",
      "title": "AWS reduces publishing time for Carbon Footprint Data to 21 days or Less",
      "summary": "AWS has reduced the publishing time for customer carbon footprint data from up to three months to just 21 days or less, with data now available between the 15th and 21st of the month following usage. This faster access to carbon footprint insights enables customers to make more timely decisions about their application deployment and identify opportunities to reduce emissions more quickly.",
      "category": "OTHER",
      "timestamp": "2025-12-16T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-reduces-publishing-time-carbon-footprint-data",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "26284e0e9bc7ff900bfd2c619afafd1c550a5c77",
      "title": "AWS Artifact enables access to previous versions of compliance reports",
      "summary": "AWS Artifact now provides self-service access to previous versions of AWS compliance reports, eliminating the need to contact AWS Support for historical documentation. This feature helps customers efficiently manage compliance requirements during audits and vendor assessments that require historical evidence. Access requires the \"artifact:ListReportVersions\" IAM permission, which is included in AWS managed policies.",
      "category": "OTHER",
      "timestamp": "2025-12-16T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-artifact-access-previous-versions-compliance-reports",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "5d30e19d3e85d699bb94187b2b423229f5d92def",
      "title": "AWS Security Incident Response introduces integration with Slack",
      "summary": "AWS Security Incident Response now integrates with Slack, allowing teams to manage security incidents through both platforms with bidirectional synchronization. This integration enables users to create and update security cases directly from Slack while maintaining automatic data replication between systems. The feature helps organizations respond to security events more efficiently by leveraging existing communication workflows within Slack.",
      "category": "SECURITY",
      "timestamp": "2025-12-16T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-security-incident-response-integration-slack",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "2d3cf2e29ea55d15cb5369f03ec3d03b6b60a665",
      "title": "Amazon SageMaker AI is now available in Asia Pacific (New Zealand)",
      "summary": "Amazon SageMaker AI is now available in the Asia Pacific (New Zealand) region, allowing developers and data scientists to build, train, and deploy machine learning models locally. SageMaker AI is a fully managed platform designed to simplify the entire machine learning process by removing technical complexity from each step.",
      "category": "AI_ML",
      "timestamp": "2025-12-16T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-sagemaker-ai-asia-pacific-new-zealand",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "d540755f76150767a24609b4c219919128226c2a",
      "title": "Amazon Quick Suite now supports memory for chat agents",
      "summary": "Amazon QuickSuite has introduced a memory feature for chat agents that enables personalized responses by remembering user preferences from previous conversations. The feature allows chat agents to tailor responses based on stored preferences like response format and acronyms, eliminating the need for users to repeatedly specify these preferences. Users maintain control over their data by being able to view and delete stored memory preferences as needed.",
      "category": "OTHER",
      "timestamp": "2025-12-16T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-quick-suite-memory-chat-agents/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "a262e5188d1d6df401084e37b000b066b2a52cfe",
      "title": "Amazon EC2 M8i-flex instances are now available in Asia Pacific (Sydney) Region",
      "summary": "Amazon EC2 M8i-flex instances are now available in the Asia Pacific (Sydney) Region, powered by custom Intel Xeon 6 processors exclusive to AWS. These instances deliver up to 15% better price-performance and 2.5x more memory bandwidth compared to previous generation Intel-based instances, along with up to 20% better performance than M7i-flex instances.",
      "category": "COMPUTE",
      "timestamp": "2025-12-16T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/ec2-m8i-flex-instances-sydney-region/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "6b0be18fa9ac1b9ae04ffda284741bbb100850e4",
      "title": "Amazon Quick Suite browser extension now supports Quick Flows",
      "summary": "Amazon Quick Suite's browser extension now integrates with Amazon Quick Flows, allowing users to run automated workflows directly in their web browser without manually extracting information from web pages. Users can invoke their own workflows or shared ones, passing webpage content as input seamlessly within the browser. This feature streamlines routine tasks like contract analysis and report generation by eliminating the need to switch between applications.",
      "category": "OTHER",
      "timestamp": "2025-12-16T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/quick-suite-browser-extension-quick-flows/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "1c18dc60274e21e555749c5f4099b2a6c775cc25",
      "title": "AWS Clean Rooms publishes events for member invitations and table readiness to EventBridge",
      "summary": "AWS Clean Rooms now publishes real-time events to Amazon EventBridge to notify members about collaboration invitations and table readiness status. This enhancement provides greater transparency by automatically alerting invited members when they receive collaboration invitations and notifying existing members when AWS Entity Resolution resources are associated with their collaboration. The feature streamlines the collaboration process by making it easier for members to stay informed about collaboration activities and respond to invitations promptly.",
      "category": "SERVERLESS",
      "timestamp": "2025-12-16T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/clean-rooms-events-member-invitations-table-readiness/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "63e6967b5ea301c294a7ab7bedde2d0af55140ea",
      "title": "Amazon Route 53 launches detailed metrics for Resolver endpoints",
      "summary": "Amazon Route 53 now offers detailed CloudWatch metrics for monitoring the performance and health of Route 53 Resolver endpoints and their associated target name servers. This enhancement improves visibility into hybrid cloud DNS configurations by providing monitoring capabilities for DNS query resolution between on-premises data centers and Amazon VPC. The metrics can be enabled individually for each Resolver endpoint through CloudWatch.",
      "category": "NETWORKING",
      "timestamp": "2025-12-16T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/route-53-detailed-metrics-resolver-endpoints/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "1298ecc04f44ecbac0b2c70a59f4b37aa56b2671",
      "title": "Amazon Connect now supports multiple choice and date questions in evaluation forms",
      "summary": "Amazon Connect has introduced two new evaluation question types: multiple choice questions that allow multiple answer selections and date questions for capturing specific timeframes. These additions enable managers to gather more detailed insights on agent performance, such as tracking customer product interests during sales calls or recording key dates like loan application and approval times. The feature enhances the platform's evaluation capabilities for both human and AI agent performance assessment.",
      "category": "OTHER",
      "timestamp": "2025-12-15T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-connect-multiple-choice-date-questions-evaluation-forms/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "736fe4622b5be878a68e461f73a0143a0644bf68",
      "title": "Amazon Elastic VMware Service (Amazon EVS) is now available in additional Regions",
      "summary": "Amazon Elastic VMware Service (Amazon EVS) has expanded to six additional AWS regions: US West (N. California), Asia Pacific (Hyderabad), Asia Pacific (Malaysia), Canada West (Calgary), Mexico (Central), and South America (So Paulo). This expansion allows customers to run VMware Cloud Foundation workloads on AWS infrastructure with greater geographic coverage and flexibility.",
      "category": "OTHER",
      "timestamp": "2025-12-15T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-evs-available-in-additional-regions/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "f2eba0efa3c00847fe1ac4881506b064d3e24799",
      "title": "Amazon Managed Service for Apache Flink is now available in AWS Asia Pacific (Auckland) Region",
      "summary": "Amazon Managed Service for Apache Flink is now available in the AWS Asia Pacific (Auckland) Region, allowing customers to build real-time stream processing applications. This managed service simplifies the process of transforming and analyzing streaming data using Apache Flink, an open-source framework for data stream processing, while reducing the complexity of building and managing Apache Flink applications.",
      "category": "DATABASE",
      "timestamp": "2025-12-15T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-managed-service-apache-flink-aws-asia-pacific-auckland-region/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "fe168a228b4fe066386b213e2fc1574d3c2632fb",
      "title": "Announcing cost allocation using users attributes",
      "summary": "AWS has launched a new cost allocation feature that leverages existing workforce user attributes (such as cost center, division, and department) to track and analyze AWS application usage and costs. This capability allows customers to allocate per-user monthly subscription and on-demand fees for AWS applications like Amazon Q Business, Amazon Q Developer, and Amazon QuickSight to their respective internal business units. Organizations can implement this by importing their workforce users' attributes to IAM Identity Center.",
      "category": "AI_ML",
      "timestamp": "2025-12-15T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/cost-allocation-using-users-attributes",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "181972ced53a0b910f4b14ba522a609b7f0243ac",
      "title": "Amazon EKS introduces enhanced network security policies",
      "summary": "Amazon EKS has introduced enhanced network security policies that allow customers to improve network security for their Kubernetes workloads and external integrations. The new capabilities build on existing network segmentation features and enable centralized enforcement of network access filters across entire clusters. The enhancement also includes DNS-based policies to secure egress traffic.",
      "category": "SECURITY",
      "timestamp": "2025-12-15T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-eks-enhanced-network-security-policies",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "b7997a42c10601969c67fa6477ff1f70f43d86cb",
      "title": "AWS Billing and Cost Management now supports PDF export and CSV data download for Dashboards",
      "summary": "AWS Billing and Cost Management has added new export capabilities for dashboards, allowing users to export entire dashboards as PDF files and download individual widget data in CSV format. These features enable offline analysis, easier sharing of cost insights across organizations, and detailed examination of data in spreadsheet applications.",
      "category": "OTHER",
      "timestamp": "2025-12-15T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-billing-cost-management-pdf-export-csv-data-download-dashboards",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "e67a4c669b9bdd577901c3882c5c591e336b4b42",
      "title": "ACM now supports automated certificate management for Kubernetes",
      "summary": "AWS Certificate Manager (ACM) now provides automated certificate provisioning and distribution for Kubernetes workloads through AWS Controllers for Kubernetes (ACK). This eliminates the previously required manual steps of exporting certificates via API, creating Kubernetes Secrets, and manually updating them during renewal. The enhancement extends ACM's existing automation capabilities beyond AWS-integrated services like Application Load Balancers and CloudFront to include Kubernetes applications that terminate TLS.",
      "category": "SECURITY",
      "timestamp": "2025-12-15T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/acm-automated-certificate-management-kubernetes/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "49ed6f42489a8748b5022fd6fb6744e111104253",
      "title": "Amazon EC2 M7a instances are now available in the Europe (London) Region",
      "summary": "Amazon EC2 M7a instances are now available in the Europe (London) Region, expanding their global availability. These general-purpose instances are powered by 4th Gen AMD EPYC processors running up to 3.7 GHz and deliver up to 50% better performance than the previous M6a generation. M7a instances are now accessible across multiple regions including the US, Asia Pacific, and several European locations.",
      "category": "COMPUTE",
      "timestamp": "2025-12-15T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/ec2-m7a-instances-europe-london-region/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "136105692ad1e9ea3e4f84b9c123a6857d0fed9f",
      "title": "AWS DataSync increases scalability and performance for on-premises file transfers",
      "summary": "AWS DataSync has launched Enhanced mode, which significantly improves data transfers between on-premises file servers and Amazon S3 by removing file count limits and delivering higher performance through parallel processing. This upgrade allows customers to transfer virtually unlimited numbers of files at faster speeds compared to the previous Basic mode. Enhanced mode maintains DataSync's secure, optimized network transfer capabilities while scaling to handle datasets of any size.",
      "category": "AI_ML",
      "timestamp": "2025-12-12T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-datasync-scalability-performance-on-premises-file-transfers",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "fd8606ae7b473bbd13f0da6a3a7d5885b0f39457",
      "title": "AWS Shield network security director now supports multi-account analysis",
      "summary": "AWS Shield's network security director now supports multi-account analysis and automated network security management, currently available in preview. The service provides visibility across AWS organizations, identifies misconfigured or missing network security services, and offers remediation recommendations. Users can designate a delegated administrator account to manage continuous network analysis across multiple accounts.",
      "category": "SECURITY",
      "timestamp": "2025-12-12T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-shield-network-security-director-multi-account-analysis",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "e47f3df4c90befb0ea19673910866617e4174a62",
      "title": "Amazon EMR Managed Scaling is now available in 7 additional AWS regions",
      "summary": "Amazon EMR Managed Scaling has expanded to 7 additional AWS regions including Asia Pacific (Malaysia, New Zealand, Taipei, Thailand), Canada West (Calgary), Mexico (Central), and US Gameday Northeast (Illinois). This feature automatically resizes EC2 instances in EMR clusters to optimize performance while minimizing costs, requiring users to only set minimum and maximum compute limits.",
      "category": "COMPUTE",
      "timestamp": "2025-12-12T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-emr-managed-scaling-additional-regions",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "eb5f6ebbf5180c5b97a71895d5efe062be3c29d3",
      "title": "Amazon MSK Replicator is now available in ten additional AWS Regions",
      "summary": "Amazon MSK Replicator, a feature that enables reliable data replication across Amazon MSK clusters, is now available in ten additional AWS Regions including locations in the Middle East, Asia Pacific, Africa, Europe, and Israel. This expansion allows customers in these regions to replicate streaming data across Amazon Managed Streaming for Apache Kafka clusters with improved regional availability.",
      "category": "ANALYTICS",
      "timestamp": "2025-12-12T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-msk-replicator-additional-aws-regions",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "49356a46f53748bbc6b9b2708acc941577b91180",
      "title": "Validate best practice compliance for SAP ABAP applications with AWS Systems Manager",
      "summary": "AWS Systems Manager Configuration Manager now enables automatic testing of SAP ABAP applications against AWS Well-Architected Framework SAP Lens best practices. This eliminates the need for SAP administrators to manually track and validate configurations against best practices from multiple sources including AWS, SAP, and operating system vendors.",
      "category": "OTHER",
      "timestamp": "2025-12-12T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/compliance-sap-abap-systems-manager/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "ec035998958cc01fa7ce2aae4c2e4cf89cc46b10",
      "title": "AWS DataSync introduces Terraform support for Enhanced mode",
      "summary": "AWS DataSync has added Terraform support for its Enhanced mode, enabling easier setup of high-performance data transfers between S3 locations at scale. Enhanced mode leverages parallel processing to improve performance and scalability for datasets of any size, while eliminating file count limitations and providing detailed transfer metrics for better monitoring.",
      "category": "OTHER",
      "timestamp": "2025-12-12T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/datasync-terraform-enhanced-mode/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "72b94db71aff342c9f823f874e79d2f535fd9959",
      "title": "AWS Elastic Beanstalk is now available in additional regions",
      "summary": "AWS Elastic Beanstalk is now generally available in five additional regions: Asia Pacific (Melbourne, Malaysia, and Hyderabad), Canada West (Calgary), and Europe (Zurich). This expansion allows more developers in these regions to use the service that automatically handles application deployment, scaling, load balancing, and health monitoring on AWS infrastructure.",
      "category": "OTHER",
      "timestamp": "2025-12-12T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/elastic-beanstalk-additional-regions/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "d413389c43af14471cc95ff340d792a2006a4d28",
      "title": "Amazon EC2 X2iedn instances now available in AWS Asia Pacific (Thailand) region",
      "summary": "Amazon EC2 X2iedn instances, which are memory-optimized instances powered by 3rd generation Intel Xeon Scalable Processors, are now available in the AWS Asia Pacific (Thailand) region. These instances are designed for memory-intensive workloads and offer improved performance, price performance, and cost per GiB of memory compared to previous X1e instances. The instances are SAP-certified for running Business Suite on HANA applications.",
      "category": "COMPUTE",
      "timestamp": "2025-12-12T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/ec2-x2iedn-instances-thailand-region/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "81a51220eb5efe8ae19395a8da5080648bf39c1a",
      "title": "Amazon EC2 X2iedn instances now available in AWS Europe (Zurich)  region",
      "summary": "Amazon EC2 X2iedn instances, which are memory-optimized and powered by 3rd generation Intel Xeon Scalable Processors, are now available in the AWS Europe (Zurich) region. These instances are designed for memory-intensive workloads and offer improved performance, price performance, and cost per GiB of memory compared to previous X1e instances. They are SAP-certified for running Business Suite on HANA and SAP S/4HANA applications.",
      "category": "COMPUTE",
      "timestamp": "2025-12-12T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/ec2-x2iedn-instances-zurich-region/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "3a1cf1de614847985ae1399f1d07a9d0ce148678",
      "title": "Amazon Aurora DSQL now supports cluster creation in seconds",
      "summary": "Amazon Aurora DSQL has significantly improved cluster creation speed, reducing setup time from minutes to just seconds. This enhancement allows developers to instantly provision databases for rapid prototyping and immediately start building using the integrated query editor in the AWS console. The faster provisioning eliminates the need for external client configuration and supports AI-powered development through the Aurora DSQL Model Context Protocol server.",
      "category": "DATABASE",
      "timestamp": "2025-12-11T21:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-aurora-dsql-cluster-creation-in-seconds",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "4925c05996b58039e5ca34cbf9c3f84dabf84f3b",
      "title": "Amazon WorkSpaces Secure Browser introduces Web Content Filtering",
      "summary": "Amazon WorkSpaces Secure Browser has added Web Content Filtering capabilities that allow administrators to control and monitor employee web access through granular policies and URL/domain blocking across 25+ predefined categories. The new feature integrates with Session Logger for enhanced monitoring and compliance reporting, helping organizations maintain security and regulatory compliance for web browsing activities.",
      "category": "SECURITY",
      "timestamp": "2025-12-11T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-workspaces-secure-browser-web-content-filtering/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "05fe58e60a393185d0c31969c21d43fdd4589cd1",
      "title": "Amazon Cognito identity pools now support private connectivity with AWS PrivateLink",
      "summary": "Amazon Cognito identity pools now support AWS PrivateLink, allowing secure exchange of federated identities for AWS credentials through private connectivity between your VPC and Cognito without routing traffic over the public internet. This enhancement provides improved security by keeping authentication traffic within AWS's private network infrastructure. The feature enables identity pools to map authenticated and guest identities to IAM roles while maintaining private connectivity throughout the credential exchange process.",
      "category": "SECURITY",
      "timestamp": "2025-12-11T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-cognito-identity-pools-private-connectivity-aws-privatelink",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "fc9e944f9f2ebb787d1a4268cf07c56feca89052",
      "title": "Amazon Aurora PostgreSQL now supports integration with Kiro powers",
      "summary": "Amazon Aurora PostgreSQL now supports integration with Kiro powers, which provides AI agent-assisted development tools to help developers build Aurora PostgreSQL applications more quickly. Kiro powers offers a repository of curated Model Context Protocol (MCP) servers, steering files, and hooks that are validated by partners to accelerate specialized software development and deployment. This integration packages Aurora PostgreSQL-specific MCP server components to streamline the development process.",
      "category": "SECURITY",
      "timestamp": "2025-12-11T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-aurora-postgresql-integration-kiro-powers",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "206a8e4ca98958b434ffd4f0ca1a5e1a28d83b67",
      "title": "AWS Application Migration Service supports IPv6",
      "summary": "AWS Application Migration Service (MGN) now supports IPv6 for both service communication and application migrations, allowing organizations to migrate IPv6-enabled applications to modern network infrastructures. The service provides new dual-stack endpoints that support both IPv4 and IPv6 communications, giving users flexibility to transfer replication data using either protocol while maintaining network connectivity.",
      "category": "SECURITY",
      "timestamp": "2025-12-11T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/application-migration-service-ipv6/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "641b70e9a1e6e43244f82ba2823edb2b8b335707",
      "title": "Amazon EC2 High Memory U7i instances now available in additional regions",
      "summary": "Amazon EC2 High Memory U7i instances are now available in additional AWS regions, including 24TB memory instances in Europe (Frankfurt), 16TB instances in Asia Pacific (Mumbai), and 6TB instances in Europe (Paris). These 7th generation instances are powered by custom fourth generation Intel Xeon Scalable Processors (Sapphire Rapids) and provide high-memory computing capabilities for memory-intensive workloads.",
      "category": "COMPUTE",
      "timestamp": "2025-12-11T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/ec2-high-memory-u7i-instances-additional-regions/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "769903e1bc50f8c60571b641a8b66adf71827639",
      "title": "Amazon EC2 I7i instances now available in additional AWS regions",
      "summary": "Amazon EC2 I7i instances are now available in additional AWS regions including Asia Pacific (Singapore, Jakarta) and Europe (Stockholm). These high-performance storage-optimized instances are powered by 5th generation Intel Xeon Scalable processors and deliver up to 23% better compute performance and over 10% better price performance compared to previous generation I4i instances.",
      "category": "COMPUTE",
      "timestamp": "2025-12-11T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/ec2-i7i-instances-additional-regions/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "456ac9b80bf5dd0cd5a05bd65b4930217308f88e",
      "title": "Amazon EC2 C7i instances are now available in the Asia Pacific (Hyderabad) Region",
      "summary": "Amazon EC2 C7i instances, powered by custom 4th generation Intel Xeon Scalable processors (Sapphire Rapids), are now available in the Asia Pacific (Hyderabad) Region. These instances offer up to 15% better price-performance compared to C6i instances and are optimized for compute-intensive workloads like batch processing, distributed analytics, and ad-serving.",
      "category": "COMPUTE",
      "timestamp": "2025-12-11T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/ec2-c7i-instances-asia-pacific-hyderabad-region/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "1715fb770ba3d8bdda1d90386b25678af3a3b005",
      "title": "Amazon ECS now supports custom container stop signals on AWS Fargate",
      "summary": "Amazon ECS now supports custom container stop signals for Linux tasks on AWS Fargate, allowing containers to use their preferred termination signals as defined in OCI images instead of always receiving SIGTERM. This enhancement enables more graceful shutdown behavior by aligning Fargate task termination with each container's specific stop signal configuration.",
      "category": "CONTAINERS",
      "timestamp": "2025-12-10T20:48:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-ecs-custom-container-stop-signals-fargate/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "39f19a307d1a5a331093e42b995deffeb9cc1e12",
      "title": "Now generally available: Amazon EC2 C8gb instances",
      "summary": "AWS has announced the general availability of Amazon EC2 C8gb instances, which are powered by AWS Graviton4 processors and optimized for Amazon EBS storage. These new instances deliver up to 30% better compute performance compared to Graviton3 processors and offer up to 150 Gbps of EBS bandwidth. The C8gb instances provide higher EBS performance compared to equivalent-sized Graviton4-based instances, making them ideal for workloads requiring enhanced block storage performance.",
      "category": "COMPUTE",
      "timestamp": "2025-12-10T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/generally-available-amazon-ec2-c8gb-instances",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "8f49bb4d3862f1de3c70771c8a8953f109576533",
      "title": "Amazon EC2 X8g instances now available in Asia Pacific (Sydney) region",
      "summary": "Amazon EC2 X8g instances powered by AWS Graviton4 processors are now available in the Asia Pacific (Sydney) region, offering up to 60% better performance than Graviton2-based X2gd instances. These instances provide up to 3 TiB of total memory with increased memory per vCPU, making them ideal for memory-intensive workloads while delivering the best price performance among EC2 X-series instances.",
      "category": "COMPUTE",
      "timestamp": "2025-12-10T16:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-ec2-x8g-instances-asia-pacific-sydney/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "28792ca77e77ee6b650cd0a05c82c32821230b32",
      "title": "Amazon ElastiCache Serverless now supports same-slot WATCH command",
      "summary": "Amazon ElastiCache Serverless now supports the WATCH command for same-slot transactions, enabling developers to build more reliable applications with better data consistency in high-concurrency environments. The WATCH command makes transactions conditional by ensuring they only execute when the monitored keys remain unchanged, but it works specifically with transactions operating on keys within the same hash slot as the watched keys.",
      "category": "DATABASE",
      "timestamp": "2025-12-10T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-elasticache-serverless-same-slot-watch-command",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "837a7e9e0f502733c0a5e4243dc407d984430931",
      "title": "Amazon CloudWatch SDK supports optimized JSON, CBOR protocols",
      "summary": "Amazon CloudWatch has added support for JSON and CBOR (Concise Binary Object Representation) protocols in its SDK to deliver lower latency and better performance. The SDK automatically selects the optimal protocol, resulting in reduced payload sizes, decreased CPU and memory usage, and faster end-to-end processing for CloudWatch customers.",
      "category": "OTHER",
      "timestamp": "2025-12-10T12:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-cloudwatch-sdk-json-cbor-protocols",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "16b1f5d3eac17862ff9050277738e8dcfad0cdc3",
      "title": "Amazon Braket now supports Qiskit 2.0",
      "summary": "Amazon Braket now supports Qiskit 2.0, allowing quantum developers to use the latest version of the popular quantum software framework with enhanced native capabilities. The integration includes native implementations of Qiskit's Sampler and Estimator primitives that use Braket's program sets for optimized batching, which reduces both execution time and costs compared to generic wrapper approaches.",
      "category": "OTHER",
      "timestamp": "2025-12-10T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-braket-qiskit-2-0/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "e73f6bccb16221d99bff9d094e443fd0247ef451",
      "title": "AWS Support Center Console now supports  screen sharing for troubleshooting support cases",
      "summary": "AWS has launched a new screen sharing feature for the AWS Support Center Console that allows customers to request virtual meetings during active support chats or calls. Users can join support calls with one click through a meeting bridge link and share their screens with AWS support representatives for more efficient troubleshooting. This enhancement streamlines the support experience by maintaining seamless access to case details during virtual meetings.",
      "category": "OTHER",
      "timestamp": "2025-12-10T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/support-center-console-screen-sharing/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "a64b40a426341cc0856f7569bc47cadaef18b7bc",
      "title": "Amazon EC2 C8gn instances are now available in additional regions",
      "summary": "Amazon EC2 C8gn instances powered by AWS Graviton4 processors are now available in the US East (Ohio) and Middle East (UAE) regions. These new instances deliver up to 30% better compute performance compared to the previous Graviton3-based C7gn instances and feature 6th generation AWS Nitro Cards with up to 600 Gbps network bandwidth, making them the highest network bandwidth offering among network-optimized EC2 instances.",
      "category": "AI_ML",
      "timestamp": "2025-12-09T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-ec2-c8gn-instances-additional-regions",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "3c7631cdd7e5e3be66e1824b54d6e784e3d388ab",
      "title": "Amazon EC2 X8g instances now available in Europe (Stockholm) region",
      "summary": "Amazon EC2 X8g instances are now available in the Europe (Stockholm) region, powered by AWS Graviton4 processors and offering up to 3 TiB of total memory with increased memory per vCPU. These instances are specifically designed for memory-intensive workloads including electronic design automation, in-memory databases, relational databases, and real-time big data applications.",
      "category": "COMPUTE",
      "timestamp": "2025-12-09T16:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-ec2-x8g-instances-europe-stockholm/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "46927d2a8a9a893679eb3ff49e6377f2bb7ff360",
      "title": "AWS Partner Central now includes opportunity deal sizing",
      "summary": "AWS has launched a new AI-powered deal sizing feature in AWS Partner Central that helps partners quickly estimate AWS monthly recurring revenue (MMR) and receive service recommendations when managing opportunities. The feature is integrated within APN Customer Engagements (ACE) Opportunities and can automatically populate deal information by importing AWS Pricing Calculator URLs. This capability streamlines deal management by reducing the time partners spend on revenue estimation tasks.",
      "category": "OTHER",
      "timestamp": "2025-12-09T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-partner-central-opportunity-deal-sizing",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "7c8f10ae67588ff1779efa72dafa79fae3991bba",
      "title": "Amazon RDS and Aurora now support resource tagging for Automated Backups",
      "summary": "Amazon RDS and Aurora now support resource tagging for automated backups, allowing you to tag backups separately from their parent DB instances or clusters. This enhancement enables Attribute-Based Access Control (ABAC) and improves resource management and cost tracking by letting you control access and permissions through IAM policies using these tags.",
      "category": "DATABASE",
      "timestamp": "2025-12-09T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/rds-aurora-resource-tagging-automated-backups/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "abf87a984d83fb7e562781f11c75722e2d1f5655",
      "title": "Amazon GameLift Servers enhances AWS Console for game developers with AI powered assistance",
      "summary": "Amazon GameLift Servers has launched AI-powered assistance in the AWS Console using Amazon Q Developer to provide specialized guidance for game developers. The new feature helps developers navigate complex workflows, troubleshoot issues, and optimize game server deployments with tailored recommendations for integration, fleet configuration, and performance optimization.",
      "category": "AI_ML",
      "timestamp": "2025-12-09T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/gamelift-servers-console-developers-ai-powered/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "da40f8b372671247469a36c25ec9a7b988df1df6",
      "title": "Amazon Quick Suite integrates Quick Research with Quick Flows for report automation",
      "summary": "Amazon Quick Suite now integrates Quick Research with Quick Flows, allowing teams to automatically generate comprehensive research reports as part of multi-step workflows. This integration transforms research projects into reusable, shareable workflows across organizations. Quick Suite is Amazon's AI-powered workspace designed to help businesses quickly derive insights from their data and take action.",
      "category": "OTHER",
      "timestamp": "2025-12-08T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-quick-suite-research-flows-report-automation",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "8b028e80c451a32178c504682dacd9a85e1eb3bc",
      "title": "Announcing Spatial Data Management on AWS to accelerate spatial-data insights",
      "summary": "AWS has announced Spatial Data Management on AWS (SDMA), a new solution that allows customers to store, enrich, and connect multimodal spatial data (including 3D, geospatial, behavioral, and temporal data) at scale in a secure, centralized cloud environment. SDMA functions as a collaborative hub that connects customers' spatial data with their ISV SaaS applications and AWS services to accelerate spatial data insights.",
      "category": "OTHER",
      "timestamp": "2025-12-08T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/spatial-data-management-spatial-data-insights/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "4b17110c60c4e2725b3c5d1017abf6ca44b60733",
      "title": "Amazon OpenSearch Service now supports automatic semantic enrichment",
      "summary": "Amazon OpenSearch Service now offers automatic semantic enrichment for managed clusters, extending a capability previously available only in OpenSearch Serverless. This feature enables semantic search that understands context and meaning rather than just exact phrase matching, delivering more relevant search results with minimal configuration required.",
      "category": "AI_ML",
      "timestamp": "2025-12-05T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/opensearch-service-automatic-semantic-enrichment/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "304b1cca90799c859d38ef4e327f3bb577f4a244",
      "title": "TwelveLabs Pegasus 1.2 model now in 23 new AWS regions via Global cross-region inference",
      "summary": "Amazon Bedrock has expanded access to TwelveLabs' Pegasus 1.2 model to 23 additional AWS regions through Global cross-region inference, bringing the total to 30 available regions. The service now includes Geographic cross-region inference for EU regions, which helps meet data residency and compliance requirements by keeping workloads within specific geographic boundaries.",
      "category": "AI_ML",
      "timestamp": "2025-12-05T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/twelvelabs-pegasus-available-with-global-cross-region-inference/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "2812e5d378e844840c1e09b198ed4c659082b22a",
      "title": "SES Mail Manager is now available in 10 additional AWS Regions, 27 total",
      "summary": "Amazon SES has expanded its Mail Manager product to 10 additional AWS Regions, bringing the total to 27 commercial regions where it's available. This expansion means Mail Manager is now offered in all commercial regions where SES provides its core Outbound service. Mail Manager enables customers to configure email routing and delivery mechanisms for their domains while providing unified email governance, risk, and compliance management.",
      "category": "SECURITY",
      "timestamp": "2025-12-05T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/ses-mail-manager-10-regions/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "bbdd87e2ad452184c93ed6e9aa8d438ec570c2cf",
      "title": "Amazon SES adds VPC support for API endpoints",
      "summary": "Amazon SES now supports VPC endpoints, allowing customers to access SES APIs for sending emails and managing configurations directly through their Virtual Private Cloud without requiring an internet gateway. This enhancement improves security by keeping traffic within the VPC instead of routing it through the public internet. The feature enables more secure email operations for workloads running entirely within AWS VPCs.",
      "category": "SECURITY",
      "timestamp": "2025-12-05T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-ses-vpc-api-endpoints/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "09d37c31f8439a41281996d8cbacbd8681422603",
      "title": "Amazon Connect launches WhatsApp channel for Outbound Campaigns",
      "summary": "Amazon Connect has added WhatsApp support for Outbound Campaigns, allowing businesses to proactively reach customers through automated WhatsApp messages. This feature enables companies to send appointment reminders, payment notifications, order updates, and product recommendations directly via WhatsApp. The setup process uses the same familiar Amazon Connect interface, building on existing WhatsApp Business messaging capabilities.",
      "category": "AI_ML",
      "timestamp": "2025-12-05T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/connect-whatsapp-channel-outbound-campaigns/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "6db51ffdd330febe841610bd7c5918887bbf023c",
      "title": "Amazon SageMaker now supports self-service migration of Notebook instances to latest platform versions",
      "summary": "Amazon SageMaker now allows users to self-service migrate their Notebook instances to newer platform versions using the UpdateNotebookInstance API with a new PlatformIdentifier parameter. This feature enables seamless transitions from older, unsupported platform identifiers (notebook-al1-v1, notebook-al2-v1, notebook-al2-v2) to currently supported versions (notebook-al2-v3, notebook-al2023-v1).",
      "category": "AI_ML",
      "timestamp": "2025-12-05T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-sagemaker-self-service-migration-notebook-instances",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "e236474a29f9c9962b10e45a970ab680cabe0083",
      "title": "AWS Elastic Beanstalk now supports Node.js 24 on Amazon Linux 2023",
      "summary": "AWS Elastic Beanstalk now supports Node.js 24 applications running on the Amazon Linux 2023 (AL2023) platform. This update allows developers to access the latest Node.js features and improvements while benefiting from AL2023's enhanced security and performance capabilities through Beanstalk's managed deployment service.",
      "category": "SECURITY",
      "timestamp": "2025-12-05T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/elastic-beanstalk-node-js-24-linux-2023/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "fdf5f6b3fe1b86fc93bafe9e61805c902db0c123",
      "title": "Amazon Connect Customer Profiles launches new segmentation capabilities (Beta)",
      "summary": "Amazon Connect Customer Profiles has launched new beta segmentation capabilities powered by Spark SQL, allowing users to create sophisticated customer segments using complete profile data with AI assistance. The feature enables access to both custom and standard objects, along with advanced SQL capabilities like joining objects, filtering with statistical functions, and standardizing date fields. This enhancement provides more powerful and flexible customer segmentation tools for complex data analysis within the Amazon Connect ecosystem.",
      "category": "OTHER",
      "timestamp": "2025-12-05T15:04:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-connect-customer-profiles/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "ca845f0dcd7f1a979abfadcffb771b18302bdae1",
      "title": "AWS launches simplified enablement of AWS CloudTrail events in Amazon CloudWatch",
      "summary": "AWS has launched a simplified way to enable AWS CloudTrail events in Amazon CloudWatch, allowing users to centrally configure CloudTrail event collection alongside other AWS log sources like VPC flow logs and EKS Control Plane Logs. This new feature provides a consolidated view through CloudWatch's ingestion experience, making it easier to collect, monitor, and analyze log data from AWS resources and applications in one place.",
      "category": "CONTAINERS",
      "timestamp": "2025-12-05T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/key-enhancements-cloudtrail-events-cloudwatch/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "651a0bfdc4a000dc4a002d84ca85e8520fea0995",
      "title": "AWS Elastic Beanstalk now supports Python 3.14 on Amazon Linux 2023",
      "summary": "AWS Elastic Beanstalk now supports Python 3.14 applications on the Amazon Linux 2023 (AL2023) platform, allowing developers to use the latest Python features while benefiting from enhanced security and performance. This update enables customers to deploy and manage Python 3.14 applications through Beanstalk's infrastructure-abstracted service without having to worry about underlying server management.",
      "category": "SECURITY",
      "timestamp": "2025-12-05T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/elastic-beanstalk-python-314-linux-2023/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "f6d2b5918417ffaa3b761a9902443cedd35baece",
      "title": "Amazon Q now can analyze SES email sending",
      "summary": "Amazon Q now supports analyzing Amazon Simple Email Service (SES) email sending, allowing customers to ask questions about their SES setup and usage patterns. Q can help optimize SES configurations and troubleshoot email deliverability issues, making SES management more accessible to users with less technical expertise.",
      "category": "AI_ML",
      "timestamp": "2025-12-05T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-q-analyze-ses-email-sending/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "c92b155d1a8e581bebba2b5b14b511ffc70ccbdd",
      "title": "Amazon Bedrock now supports Responses API from OpenAI",
      "summary": "Amazon Bedrock now supports OpenAI's Responses API through new API-compatible service endpoints, enabling asynchronous inference for long-running workloads and simplified tool integration for agentic workflows. The API provides stateful conversation management, automatically rebuilding context without requiring developers to manually pass entire conversation histories with each request. This enhancement streamlines development by reducing the complexity of managing conversational state and tool interactions.",
      "category": "AI_ML",
      "timestamp": "2025-12-04T12:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-bedrock-responses-api-from-openai/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "1bf213e270559f1bb9f1a9b4453447151d57b47c",
      "title": "Announcing new Amazon EC2 M9g instances powered by AWS Graviton5 processors (Preview)",
      "summary": "AWS has announced the preview availability of new Amazon EC2 M9g instances powered by the latest AWS Graviton5 processors. These new general-purpose instances deliver up to 25% better compute performance compared to the previous generation Graviton4-based M8g instances, along with improved networking and Amazon EBS bandwidth. The Graviton5 processors are custom-designed by AWS to optimize price-performance for EC2 workloads.",
      "category": "AI_ML",
      "timestamp": "2025-12-04T09:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/ec2-m9g-instances-graviton5-processors-preview/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "345f08595809708ea4ebac6bd80b8e09c2c508d0",
      "title": "Amazon SageMaker HyperPod now supports checkpointless training",
      "summary": "Amazon SageMaker HyperPod has introduced checkpointless training, a new capability that eliminates the need for checkpoint-based job restarts during fault recovery in foundational model training. This innovation maintains continuous training momentum even when failures occur, dramatically reducing recovery time from hours to just minutes. The feature represents a significant improvement over traditional checkpoint-based recovery methods that require pausing entire training clusters and manual issue diagnosis.",
      "category": "AI_ML",
      "timestamp": "2025-12-03T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-sagemaker-hyperpod-checkpointless-training",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "2379419c497922710cfe1119f61f4f358397f6e1",
      "title": "New serverless model customization capability in Amazon SageMaker AI",
      "summary": "AWS has launched a new serverless model customization capability in Amazon SageMaker AI that allows developers to quickly customize popular AI models using supervised fine-tuning and reinforcement learning techniques. This feature addresses the common need for developers to customize models with proprietary data to improve accuracy. SageMaker AI is AWS's fully managed service designed to provide comprehensive tools for high-performance, cost-effective AI model development across various use cases.",
      "category": "AI_ML",
      "timestamp": "2025-12-03T14:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/new-serverless-model-customization-capability-amazon-sagemaker-ai",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "736e2e303e55b235a1ad2907d672fe0b436715a2",
      "title": "Announcing TypeScript support in Strands Agents (preview) and more",
      "summary": "AWS has announced TypeScript support (in preview) for Strands Agents, their open source SDK for building AI agents. Previously only available in Python since its May release, developers can now choose between Python and TypeScript when building Strands Agents. The TypeScript implementation includes full type safety, async/await support, and follows modern JavaScript/TypeScript conventions.",
      "category": "SERVERLESS",
      "timestamp": "2025-12-03T14:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/typescript-strands-agents-preview",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "9c31bc9aca62069c3aee0f5ccbd4420d033193b9",
      "title": " Introducing elastic training on Amazon SageMaker HyperPod",
      "summary": "Amazon SageMaker HyperPod now offers elastic training capabilities that automatically scale foundation model training workloads based on available resources and priorities. This eliminates the need for manual intervention when compute availability changes, saving significant engineering time previously spent halting and reconfiguring training jobs. The feature represents a shift from fixed-resource training to dynamic scaling that accelerates model development workflows.",
      "category": "AI_ML",
      "timestamp": "2025-12-03T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/elastic-training-amazon-sagemaker-hyperpod/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "2704df6a7fca40dc868cee89aa75a7578a97ced5",
      "title": "Amazon Bedrock now supports reinforcement fine-tuning delivering 66% accuracy gains on average over base models",
      "summary": "Amazon Bedrock now offers reinforcement fine-tuning capabilities that allow developers to improve model accuracy by an average of 66% without requiring extensive machine learning expertise or large labeled datasets. This automated workflow enables models to align with specific requirements using only a small set of prompts rather than traditional large-scale data approaches. The feature makes advanced model customization accessible to everyday developers through Bedrock's streamlined automation.",
      "category": "SECURITY",
      "timestamp": "2025-12-03T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/bedrock-reinforcement-fine-tuning-66-base-models/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "50be67446002d2314427fa744e4d52d2c8130363",
      "title": "Announcing Amazon EC2 General purpose M8azn instances (Preview)",
      "summary": "Amazon has announced the preview availability of new EC2 M8azn instances, which are general-purpose, high-frequency compute instances powered by fifth-generation AMD EPYC processors. These instances offer the highest maximum CPU frequency available in the cloud at 5GHz, delivering up to 2x better compute performance compared to previous-generation M5zn instances and 24% higher performance than M8a instances.",
      "category": "COMPUTE",
      "timestamp": "2025-12-02T16:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-amazon-ec2-m8azn-preview",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "f17fc1f9ec3bfab97a6e4b4c9f10cd2fa70cd1b4",
      "title": "Announcing Amazon Nova 2 Sonic for real-time conversational AI",
      "summary": "Amazon has announced the availability of Amazon Nova 2 Sonic, a new speech-to-speech AI model designed for real-time conversational applications. The model features industry-leading quality and pricing, with robust streaming speech understanding that handles background noise and various speaking styles, efficient dialog management, and expressive multilingual voice generation. Nova 2 Sonic offers superior reasoning capabilities and is optimized for natural voice-based conversational AI experiences.",
      "category": "AI_ML",
      "timestamp": "2025-12-02T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-nova-2-sonic-real-time-conversational-ai/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "6554a4397c5dd956444d931259ae605faee95f80",
      "title": "Announcing the Apache Spark upgrade agent for Amazon EMR",
      "summary": "AWS has launched the Apache Spark upgrade agent for Amazon EMR, a new tool that significantly accelerates Apache Spark version upgrades for both EMR on EC2 and EMR Serverless. The agent reduces complex upgrade processes from months to weeks by automating code analysis and transformation, eliminating the need for organizations to invest substantial engineering resources in manually analyzing API changes and resolving conflicts. The tool features a conversational interface to streamline the upgrade experience.",
      "category": "AI_ML",
      "timestamp": "2025-12-02T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/apache-spark-upgrade-agent-amazon-emr",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "a926ba0745afe3581a5a7ec9c5112cfcf69f211c",
      "title": "Amazon RDS for SQL Server now supports Developer Edition",
      "summary": "Amazon RDS for SQL Server now supports Microsoft SQL Server 2022 Developer Edition, a free version that includes all Enterprise Edition features for non-production use. This allows customers to build, test, and demonstrate applications while reducing costs and maintaining consistency with their production database environments.",
      "category": "DATABASE",
      "timestamp": "2025-12-02T14:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-rds-sql-server-supports-developer-edition/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "cff14ac532f0894433377e6633adeb67d4f75d5f",
      "title": "Amazon S3 Storage Lens adds performance metrics, support for billions of prefixes, and export to S3 Tables",
      "summary": "Amazon S3 Storage Lens has introduced three new capabilities to enhance storage visibility and optimization: performance metrics that reveal how applications interact with S3 data, analytics support for billions of prefixes within buckets, and direct metrics export to S3 Tables. These enhancements provide deeper insights into storage usage and application performance to help organizations better optimize costs, improve performance, and strengthen data protection across their S3 infrastructure.",
      "category": "STORAGE",
      "timestamp": "2025-12-02T14:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-s3-storage-lens-performance-metrics-prefixes-export-tables",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "5b199f92449179a669e41bd187187faed8f76831",
      "title": "Amazon FSx for NetApp ONTAP now supports Amazon S3 access",
      "summary": "Amazon FSx for NetApp ONTAP now allows users to attach Amazon S3 Access Points to their file systems, enabling them to access file data as if it were stored in S3. This new feature makes file data seamlessly compatible with AI, machine learning, and analytics services that work with S3, while the data remains in the original FSx for NetApp ONTAP file system.",
      "category": "AI_ML",
      "timestamp": "2025-12-02T14:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-fsx-netapp-ontap-s3-access",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "2b94a5dd5027c268e1812c5421dda67ff036cda5",
      "title": "Amazon RDS for SQL Server launches optimize CPU with new generation instances for up to 55% lower price",
      "summary": "Amazon RDS for SQL Server has launched \"optimize CPU\" support for new M7i and R7i instance families, offering up to 55% lower prices compared to previous generation instances. This feature optimizes Simultaneous Multi-threading (SMT) configuration to reduce commercial software licensing charges. Customers can achieve cost savings by upgrading from 6th generation instances, with additional reductions available for memory or IO-intensive database workloads.",
      "category": "DATABASE",
      "timestamp": "2025-12-02T14:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-rds-sql-server-optimized-cpu-lower-prices",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "4b1dc89923484a7d9b15302b21443b4faf3f215c",
      "title": "Amazon EC2 P6e-GB300 UltraServers accelerated by NVIDIA GB300 NVL72 are now generally available",
      "summary": "AWS has launched Amazon EC2 P6e-GB300 UltraServers, powered by NVIDIA GB300 NVL72 chips, which offer 1.5x more GPU memory and 1.5x better FP4 compute performance compared to the previous P6e-GB200 generation. These new instances are designed to optimize performance for powerful AI models in production, particularly for applications requiring higher context processing and emerging techniques like reasoning and Agentic AI.",
      "category": "COMPUTE",
      "timestamp": "2025-12-02T14:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-ec2-p6e-gb300-ultraservers-nvidia-gb300-nvl72-generally-available",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "f85d527c4bf12dcbe1a548b2d1db9343c7cd9915",
      "title": "Announcing new memory-optimized Amazon EC2 X8aedz Instances ",
      "summary": "AWS has announced the new EC2 X8aedz instances, which are memory-optimized instances powered by 5th generation AMD EPYC processors and offer the highest maximum CPU frequency of 5GHz in the cloud. These instances deliver up to 2x higher compute performance compared to the previous generation X2iezn instances and are built using sixth-generation AWS Nitro Cards. They are specifically designed for electronic design automation (EDA) workloads and other memory-intensive applications.",
      "category": "COMPUTE",
      "timestamp": "2025-12-02T14:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/memory-optimized-amazon-ec2-x8aedz-instances/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "5458bd459c631a0bb11e2513f819332e20ad4db1",
      "title": "Announcing Amazon EC2 Memory optimized X8i instances (Preview)",
      "summary": "Amazon Web Services has announced the preview of Amazon EC2 X8i instances, next-generation memory-optimized instances powered by custom Intel Xeon 6 processors. These instances offer significant improvements over previous X2i instances, including 1.5x more memory capacity (up to 6TB), up to 3.4x more memory bandwidth, and 46% higher SAPS performance. The X8i instances will be SAP-certified and deliver the highest performance and fastest memory among comparable Intel processors available in the cloud.",
      "category": "COMPUTE",
      "timestamp": "2025-12-02T14:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-ec2-x8i-instances-preview",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "e816356b415ca468d2acf9a92a83da16c91fd6f5",
      "title": "AWS Transform launches an AI agent for full-stack Windows modernization",
      "summary": "AWS Transform has launched a new AI agent that expands beyond .NET modernization to handle full-stack Windows application transformation, including both .NET applications and their Microsoft SQL Server databases. The agent automates the conversion of these Windows workloads to Amazon Aurora PostgreSQL and deploys them as containers on Amazon ECS or EC2 Linux. This full-stack approach accelerates Windows modernization by 5x compared to traditional methods.",
      "category": "DATABASE",
      "timestamp": "2025-12-01T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-transform-ai-agent-full-stack-windows-modernization",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "91bb4e093f31e916bc31bebd9c622a8c0f430ff9",
      "title": "AWS Transform for mainframe now supports application reimagining",
      "summary": "AWS Transform for mainframe has added new data and activity analysis capabilities that provide comprehensive insights to help reimagine legacy mainframe applications. These insights, combined with business logic extraction, enable organizations to decompose legacy applications into logical business domains. The enhanced capabilities create detailed specifications that coding agents like Kiro can use to transform applications into cloud-native architectures.",
      "category": "OTHER",
      "timestamp": "2025-12-01T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/transform-mainframe-application-reimagining/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "44c537e389fbb1286efdab3438d32d577ab83c2f",
      "title": "AWS Transform adds new agentic AI capabilities for enterprise VMware migrations",
      "summary": "AWS Transform has introduced new agentic AI capabilities that automate VMware migrations to AWS by collaborating with migration teams to understand business priorities and intelligently plan migrations. The AI agent can discover on-premises environments, prioritize applications, and migrate hundreds of applications across thousands of servers with significantly reduced manual effort and complexity. This enhancement streamlines the traditionally complex process of enterprise VMware-to-AWS migrations through intelligent automation.",
      "category": "OTHER",
      "timestamp": "2025-12-01T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/transform-vmware-agentic-ai-enterprise-migration/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "68b8d349096c55692bb444970d8f764d6467a3c2",
      "title": "AWS Transform for mainframe delivers new testing automation capabilities",
      "summary": "AWS Transform for mainframe has launched new testing automation capabilities designed to accelerate and de-risk mainframe modernization projects. The new features include automated test plan generation, test data collection scripts, test case automation scripts, and functional test environment tools for continuous delivery and regression testing. These capabilities aim to address key testing challenges that organizations face during mainframe modernization initiatives.",
      "category": "OTHER",
      "timestamp": "2025-12-01T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/transform-mainframe-testing-automation/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "1b23688a4d36172a0c09e3c0434d6b8f41753170",
      "title": "AWS launches AWS Transform custom to accelerate organization-wide application modernization",
      "summary": "AWS has launched AWS Transform custom, a generally available agentic AI service designed to accelerate organization-wide application modernization at scale. The service specifically targets legacy systems including Windows, mainframe, and VMware environments to reduce technical debt and prepare technology stacks for AI integration. This addresses the significant resource burden organizations face, as they typically allocate 20-30% of their software development resources to maintaining outdated systems.",
      "category": "OTHER",
      "timestamp": "2025-12-01T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/transform-custom-organization-wide-modernization/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "50dfde60b6a2addbcf8af73ccd8b74df6526000e",
      "title": "AWS Transform expands .NET transformation capabilities and enhances developer experience",
      "summary": "AWS Transform is now generally available with expanded .NET transformation capabilities that allow customers to modernize .NET Framework and .NET code to .NET 10 or .NET Standard. The service includes new features for UI porting from ASP.NET Web Forms to Blazor on ASP.NET Core and Entity Framework ORM code transformation. These capabilities come with an enhanced, customizable developer experience integrated into the AWS Toolkit for Visual Studio 2022.",
      "category": "OTHER",
      "timestamp": "2025-12-01T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/transform-net-transformation-developer-experience/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "63e006270dd75824c1009da50883e533f954a83d",
      "title": "Amazon Connect now provides native testing and simulation capabilities (Preview)",
      "summary": "Amazon Connect has launched native testing and simulation capabilities in preview, allowing users to validate contact center workflows and self-service voice interactions with just a few clicks. The feature enables configuration of test parameters including caller information, call reasons, expected responses, and various business scenarios like after-hours conditions. This streamlines the process of testing and validating contact center experiences before deployment.",
      "category": "OTHER",
      "timestamp": "2025-11-30T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-connect-native-testing-simulation-capabilities-preview",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "6a6c868f1e2a7ccceea67334125c500726a59178",
      "title": "Amazon Connect launches automated email responses using conditional keywords and phrases",
      "summary": "Amazon Connect has introduced automated email responses that use conditional keywords and phrases to trigger appropriate replies without agent involvement. This feature enables organizations to increase self-service capabilities and reduce manual handling time by automatically responding to common inquiries like product availability or shipment status. The automation is implemented by adding a \"Get stored content\" block to customer service flows with keyword-based routing logic.",
      "category": "OTHER",
      "timestamp": "2025-11-30T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-connect-automated-email-responses/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "a41a81211da7c1989b7334c01bf3b7c397631742",
      "title": "Amazon Connect Chat now supports agent-initiated workflows",
      "summary": "Amazon Connect Chat now enables agents to send interactive forms directly within chat conversations to collect sensitive information or share policies, eliminating the need for customers to leave the chat interface. This new agent-initiated workflow feature allows agents to trigger forms at any point during conversations, such as when customers need to update their address. The enhancement aims to streamline processes, increase efficiency, and improve overall customer experience.",
      "category": "SECURITY",
      "timestamp": "2025-11-30T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-connect-chat-agent-initiated-workflows",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "39f008e515a1cf9f754709a37e28ccf055e17dbc",
      "title": "Amazon Connect now provides automated performance evaluations for self-service interactions",
      "summary": "Amazon Connect now offers automated performance evaluations for self-service interactions, allowing businesses to automatically assess the quality of customer interactions and gain insights to improve customer experience. Managers can define custom evaluation criteria that can be populated manually or automatically using conversational analytics and other Connect data. This feature helps identify issues such as AI agents repeatedly failing to understand customers, enabling businesses to optimize their self-service capabilities.",
      "category": "OTHER",
      "timestamp": "2025-11-30T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-connect-automated-performance-evaluations-self-service-interactions",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "a654e2e187ede7577cfea265e61b171f670a3c9e",
      "title": "Amazon Connect now supports AI agent assistance and summarization for Agentforce Service",
      "summary": "Amazon Connect has launched AI agent assistance and contact summarization for Salesforce Contact Center integration, enabling AI agents to automatically access Salesforce CRM data and knowledge base articles for faster issue resolution across voice and chat channels. When human agents need to intervene, they receive a unified customer view through the seamless integration. This enhancement aims to accelerate customer service resolution while maintaining consistency across different interaction types.",
      "category": "OTHER",
      "timestamp": "2025-11-30T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-connect-ai-agent-assistance-summarization-agentforce-service",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "29bd18ca11c9a2210a356afa62497c394c777987",
      "title": "Amazon Connect now provides improved analytics and monitoring for AI agents",
      "summary": "Amazon Connect has launched enhanced analytics and monitoring capabilities for AI agents used in both self-service and agent assistance scenarios. The new feature includes customizable dashboards that track key performance metrics such as AI-led interactions, hand-off rates, conversation turns, and average handle time. Users can also compare performance across different AI agent versions to optimize configurations and improve customer outcomes.",
      "category": "OTHER",
      "timestamp": "2025-11-30T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-connect-improved-analytics-monitoring-ai-agents",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "0b6482d1a6b7c8c2071c51549b0dba77c559b7b2",
      "title": "Amazon Connect adds support for third-party speech-to-text and text-to-speech AI models for end-customer self-service",
      "summary": "Amazon Connect now supports third-party speech providers Deepgram (speech-to-text) and ElevenLabs (text-to-speech) for customer self-service, providing more flexibility in voice experience delivery. These third-party AI models can be integrated alongside Amazon Connect's native speech capabilities while maintaining the platform's built-in orchestration, analytics, and compliance controls. The feature is available with Amazon Connect unlimited AI across all commercial AWS regions.",
      "category": "OTHER",
      "timestamp": "2025-11-30T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-connect-third-party-speech-to-text-to-speech-ai-models",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "eb2c72ca72b14d39293cfd52eb0844125c89c0da",
      "title": "Amazon Connect launches Model Context Protocol (MCP) support",
      "summary": "Amazon Connect now supports Model Context Protocol (MCP), allowing AI agents to use standardized tools for retrieving information and completing actions in customer service scenarios. This enables AI agents to automatically handle tasks like looking up order status, processing refunds, and updating customer records during self-service interactions without human intervention. The feature enhances both customer self-service capabilities and employee assistance tools with extensible AI agent functionality.",
      "category": "AI_ML",
      "timestamp": "2025-11-30T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-connect-mcp-support",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "c90e870c85e4bd12a257e929dd0b8db345aa8a2d",
      "title": "Amazon Connect now provides granular access controls for performance evaluations",
      "summary": "Amazon Connect has introduced granular access controls for performance evaluations, allowing businesses to restrict access to specific evaluation forms and templates based on roles and business functions. This enhancement improves security by preventing unauthorized access to evaluation materials while making it easier for managers to select appropriate forms for their teams. The feature enables businesses to provide targeted access to managers and agents based on their specific business line or functional requirements.",
      "category": "SECURITY",
      "timestamp": "2025-11-30T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-connect-granular-access-controls-performance-evaluations",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "4b661f41566fdd719dc73c4617ab1f6a8d80efc3",
      "title": "Amazon Connect now streams messages for AI-powered interactions",
      "summary": "Amazon Connect now supports message streaming for AI-powered chat interactions, allowing customers to see AI agent responses as they're being generated in real-time. This feature displays status updates like \"One moment while I review your account\" and shows responses appearing progressively, reducing perceived wait times and improving customer confidence that their requests are actively being processed.",
      "category": "OTHER",
      "timestamp": "2025-11-30T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-connect-streams-messages-ai-powered-interactions",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "f62b0c7bcf7b00fa945cbe6273db997b99aa1a04",
      "title": "SageMaker HyperPod now supports Managed tiered KV cache and intelligent routing",
      "summary": "Amazon SageMaker HyperPod has introduced Managed Tiered KV Cache and Intelligent Routing capabilities to optimize large language model (LLM) inference performance, particularly for long-context prompts and multi-turn conversations. These new features help customers deploying production LLM applications achieve faster response times when processing lengthy documents or maintaining conversation context, eliminating the need to recalculate attention mechanisms for all previous tokens with each new interaction.",
      "category": "AI_ML",
      "timestamp": "2025-11-26T18:58:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/sagemaker-hyperpod-managed-tiered-kv-cache/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "ed77813d87087d01b1e93c34b1079b593e140abb",
      "title": "Amazon SageMaker HyperPod now supports custom Kubernetes labels and taints",
      "summary": "Amazon SageMaker HyperPod now supports custom Kubernetes labels and taints, giving customers precise control over pod scheduling and workload placement on EKS-orchestrated clusters. This enhancement prevents expensive GPU resources from being consumed by system pods and non-AI workloads while ensuring compatibility with custom device plugins like EFA and NVIDIA GPU operators.",
      "category": "AI_ML",
      "timestamp": "2025-11-26T18:45:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-sagemaker-hyperpod-kubernetes/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "24d8af6069970d2a01feaabbe7fe7f122e78ee80",
      "title": "Amazon Kinesis Video Streams now supports a new cost effective warm storage tier",
      "summary": "Amazon Kinesis Video Streams has introduced a new warm storage tier that provides cost-effective long-term media retention with sub-second access latency. The existing standard storage is now called the \"hot tier\" and remains optimized for real-time access and short-term storage. This new tier is designed to benefit developers building home security and enterprise video monitoring solutions who need extended media retention at lower costs.",
      "category": "SECURITY",
      "timestamp": "2025-11-26T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-kinesis-video-streams-warm-storage-tier/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "1b6b5607419b2a30084c98b9c1a6dbc15b59a821",
      "title": "Amazon Aurora now supports PostgreSQL 17.6, 16.10, 15.14, 14.19, and 13.22",
      "summary": "Amazon Aurora PostgreSQL-Compatible Edition now supports five updated PostgreSQL versions (17.6, 16.10, 15.14, 14.19, and 13.22) with community improvements, bug fixes, and Aurora-specific enhancements. A key new feature is Dynamic Data Masking (DDM), available in versions 16.10 and 17.6, which provides database-level security by dynamically masking sensitive data like personally identifiable information based on role-based policies at query time.",
      "category": "SECURITY",
      "timestamp": "2025-11-26T17:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-aurora-minor-versions-17-6-16-10-15-14-14-19-13-22",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "ec51f80d7eee599cb4369dcb3c8c4c9decd9c6da",
      "title": "Amazon S3 Block Public Access now supports organization-level enforcement",
      "summary": "Amazon S3 Block Public Access now supports organization-level enforcement through AWS Organizations, enabling centralized control of public access settings across all accounts in an organization. This feature allows administrators to standardize and enforce S3 public access policies through a single configuration applied at the root or Organizational Unit level.",
      "category": "STORAGE",
      "timestamp": "2025-11-26T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-s3-block-public-access-organization-level-enforcement",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "9986e8fe4113a48d61aa8796954dccbc5ae3c062",
      "title": "Improved AWS Health event triage",
      "summary": "AWS Health has added two new properties to its event schema - \"actionability\" and \"persona\" - to help customers better prioritize and route health events. These properties enable organizations to programmatically identify which events require customer action and automatically direct them to the appropriate teams. The enhanced schema is available through both the AWS Health API and Health EventBridge, improving operational efficiency and team coordination.",
      "category": "SECURITY",
      "timestamp": "2025-11-26T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/improved-aws-health-event-triage",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "f62792209b90d6c2d3a41f35738902b4534e1a88",
      "title": "AWS Compute Optimizer now supports unused NAT Gateway recommendations",
      "summary": "AWS Compute Optimizer now provides recommendations to identify unused NAT Gateways, helping customers reduce costs by finding gateways with no traffic activity. The service analyzes CloudWatch metrics over a 32-day period, examining factors like active connection count and incoming packets to determine which NAT Gateways are idle and can potentially be removed.",
      "category": "STORAGE",
      "timestamp": "2025-11-26T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/aws-compute-optimizer-unused-nat-gateway-recommendations",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "e56fb4c352e6f623f4164997f5af3f07ab4a3b4f",
      "title": "Amazon CloudWatch now supports deletion protection for logs",
      "summary": "Amazon CloudWatch has introduced deletion protection for log groups, allowing administrators to safeguard critical logging data from accidental or unintended deletion. This feature provides an additional security layer for important logs such as audit trails, compliance records, and operational data. When enabled, the protection prevents log groups from being deleted, helping organizations preserve essential logging information.",
      "category": "SECURITY",
      "timestamp": "2025-11-26T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-cloudwatch-deletion-protection-logs",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "51dfd65e6d11684ffbc0a672a740a5125c2b51d1",
      "title": "Amazon SageMaker HyperPod now supports programmatic node reboot and replacement",
      "summary": "Amazon SageMaker HyperPod has released new APIs (BatchRebootClusterNodes and BatchReplaceClusterNodes) that allow users to programmatically reboot and replace cluster nodes. This enhancement provides better automation capabilities for managing resilient ML clusters used for training advanced models like large language models, diffusion models, and foundation models.",
      "category": "AI_ML",
      "timestamp": "2025-11-26T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-sagemaker-hyperpod-programmatic-node-reboot-replacement",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "603dd4663b1dbc95690df39b597b1cbff70ba9e4",
      "title": "The AWS API MCP Server is now available on AWS Marketplace",
      "summary": "AWS has released the AWS API MCP Server on AWS Marketplace, allowing customers to deploy the Model Context Protocol (MCP) server to Amazon Bedrock AgentCore as a managed service. The marketplace offering includes complete deployment instructions and provides enterprise-grade features like built-in authentication and session isolation while simplifying container management.",
      "category": "SECURITY",
      "timestamp": "2025-11-26T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/the-aws-api-mcp-server-aws-marketplace",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "0a2bdec5e8d27ab3eff163fbce1609f0ef1fd4a1",
      "title": "AWS announces support for Apache Iceberg V3 deletion vectors and row lineage",
      "summary": "AWS has announced support for Apache Iceberg V3 deletion vectors and row lineage features across multiple services including Amazon EMR 7.12, AWS Glue, SageMaker notebooks, S3 Tables, and Glue Data Catalog. These capabilities enable customers to build petabyte-scale data lakes with enhanced performance for data modifications and improved tracking of record changes. The deletion vectors feature provides optimized delete operations through specialized delete files.",
      "category": "AI_ML",
      "timestamp": "2025-11-26T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/aws-apache-iceberg-v3-deletion-vectors-row-lineage",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "1a54148d0efec23f824012a464fd3b193c4bc330",
      "title": "Manage Amazon SageMaker HyperPod clusters with the new Amazon SageMaker AI MCP Server",
      "summary": "AWS has launched a new Amazon SageMaker AI MCP Server that provides tools for setting up and managing HyperPod clusters. Amazon SageMaker HyperPod simplifies generative AI model development by enabling quick scaling of training, fine-tuning, and deployment tasks across clusters of AI accelerators. The MCP Server allows AI coding assistants to provision and operate these AI/ML clusters for model training and deployment.",
      "category": "AI_ML",
      "timestamp": "2025-11-25T19:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/manage-amazon-sagemaker-hyperpod-clusters-mcp-server/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "98bd6a9ac0280d0e875eb68cf7dc2f48df015d5e",
      "title": "Introducing AWS Network Firewall Proxy in preview",
      "summary": "AWS has launched Network Firewall Proxy in public preview, enabling centralized protection against data exfiltration and malware injection. The service can be set up in explicit mode with just a few clicks to filter both outbound application traffic and incoming responses. It helps organizations efficiently manage and secure web and inter-network traffic while protecting against spoofing attempts.",
      "category": "STORAGE",
      "timestamp": "2025-11-25T19:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/aws-network-firewall-proxy-preview",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "4b2772c34d2caa806e734ec880cfc041592ecc39",
      "title": "AWS Lambda adds support for Node.js 24",
      "summary": "AWS Lambda now supports Node.js 24, allowing developers to build serverless applications using both managed runtime and container base images with automatic updates. Node.js 24 is the latest long-term support release that will receive security and bug fixes until April 2028, offering developers a simplified and modern async-focused experience.",
      "category": "SECURITY",
      "timestamp": "2025-11-25T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/aws-lambda-nodejs-24/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "6f5fddef3d21268b0fc09d7e14af6f2aecfb2441",
      "title": "Amazon OpenSearch Service introduces Agentic Search",
      "summary": "Amazon OpenSearch Service has launched Agentic Search, an intelligent agent-driven search system that understands user intent and automatically generates OpenSearch DSL queries from natural language search terms. The new feature orchestrates appropriate tools and provides transparent summaries of its decision-making process through a simple 'agentic' query clause. This transforms how users interact with their data by making search more intuitive and automated.",
      "category": "ANALYTICS",
      "timestamp": "2025-11-25T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/opensearch-service-agentic-search/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "fe6fce6fb8a6ed7c46a988a35bfd25a21246a2ed",
      "title": "Amazon SageMaker AI Inference now supports bidirectional streaming ",
      "summary": "Amazon SageMaker AI Inference has added bidirectional streaming support for real-time speech-to-text transcription, allowing models to process continuous audio streams and return partial transcripts simultaneously as users speak. This enhancement enables the development of voice agents with minimal latency by eliminating the need for batch processing and providing real-time speech processing capabilities.",
      "category": "AI_ML",
      "timestamp": "2025-11-25T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/sagemaker-ai-inference-bidirectional-streaming/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "bcd8f5c0df569e1df9129389dd1bec38b5c9b4ef",
      "title": " AWS Service Quotas adds now support for automatic quota management ",
      "summary": "AWS Service Quotas has launched automatic quota management, a new feature that monitors quota usage and sends notifications through preferred channels (email, SMS, or Slack) when usage approaches limits. The feature can automatically and safely adjust AWS service quota values based on customer usage patterns. This capability is now generally available through both the Service Quotas console and API.",
      "category": "OTHER",
      "timestamp": "2025-11-25T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/automatic-quota-management-service-quota-management/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "e668ff5f7164d7f131a08929f294fdd4842440d9",
      "title": "Amazon SageMaker AI now supports EAGLE speculative decoding",
      "summary": "Amazon SageMaker AI has added support for EAGLE speculative decoding, a new capability that can improve large language model inference throughput by up to 2.5x. This technology works by enabling models to predict and validate multiple tokens simultaneously instead of processing them one at a time, resulting in faster response times for AI applications in production.",
      "category": "AI_ML",
      "timestamp": "2025-11-25T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-sagemaker-eagle-decoding/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "1192d36cee9929755d5448af8e952251c9804ee0",
      "title": "AWS Glue Data Quality now supports rule labeling for enhanced reporting",
      "summary": "AWS Glue Data Quality now supports rule labeling, allowing users to apply custom key-value pair labels to data quality rules for better organization and reporting. This feature enables categorization of rules by business context, team ownership, compliance requirements, or any custom taxonomy that fits organizational needs. The enhancement improves filtering capabilities and enables more targeted reporting for data quality and governance initiatives.",
      "category": "ANALYTICS",
      "timestamp": "2025-11-25T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/glue-data-quality-rule-labeling-enhanced-reporting/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "b19d73841a59eedac6ea7c560acdc189530d15b0",
      "title": "AWS Glue Data Quality now supports pre-processing queries",
      "summary": "AWS Glue Data Quality now supports preprocessing queries in general availability, allowing users to transform data before running quality checks through AWS Glue Data Catalog APIs. This feature enables creating derived columns, filtering data, performing calculations, and validating column relationships directly within the data quality evaluation process. The enhancement provides greater flexibility for handling complex data quality scenarios.",
      "category": "ANALYTICS",
      "timestamp": "2025-11-25T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/aws-glue-data-quality-pre-processing-queries/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "76e15e43510d710a2848314aa45db01b216e9eff",
      "title": "Amazon Quick Suite introduces scheduling for Quick Flows",
      "summary": "Amazon Quick Flows now supports automated scheduling, allowing users to run workflows automatically at specified times or intervals without manual intervention. Users can configure flows to run daily, weekly, monthly, or on custom schedules, making it ideal for automating routine tasks like generating recurring reports. This enhancement improves operational efficiency and ensures critical workflows execute consistently.",
      "category": "OTHER",
      "timestamp": "2025-11-25T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-quick-suite-scheduling-quick-flows/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "19abf15b4a22c04100a4c10f4b1711b2ca52740c",
      "title": "OpenSearch Service Enhances Log Analytics with New PPL Experience",
      "summary": "AWS has enhanced Amazon OpenSearch Service by making Piped Processing Language (PPL) and natural language the default experience in the OpenSearch UI's Observability workspace. The update includes over 35 new commands for deep analysis and faceted exploration, designed to simplify log analytics workflows. This enhancement aims to help customers analyze large data volumes more intuitively while managing costs effectively.",
      "category": "SECURITY",
      "timestamp": "2025-11-24T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/opensearch-service-log-analytics-ppl/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "fcad7b213beb9478a38edf2f2d79d6cc5478784d",
      "title": "Amazon CloudFront announces support for mutual TLS authentication",
      "summary": "Amazon CloudFront now supports mutual TLS authentication (mTLS), a security protocol that requires both server and client to authenticate each other using X.509 certificates. This feature allows customers to validate client identities at CloudFront's edge locations, ensuring only clients with trusted certificates can access their distributions. The enhancement helps protect against unauthorized access and reduces the implementation effort previously required by customers.",
      "category": "SECURITY",
      "timestamp": "2025-11-24T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-cloudfront-mutual-tls-authentication/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "d06dd1de4e42f9d1944afe97a3a3e222ba04ccb7",
      "title": "Amazon EC2 announces interruptible Capacity Reservations",
      "summary": "Amazon EC2 has launched interruptible Capacity Reservations, allowing organizations to make their unused On-Demand Capacity Reservations (ODCRs) temporarily available to other workloads within their organization. This feature helps maximize utilization of reserved compute capacity while maintaining the ability to reclaim that capacity when needed for critical operations. The enhancement aims to improve cost efficiency by reducing waste from underutilized reserved capacity.",
      "category": "AI_ML",
      "timestamp": "2025-11-24T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-ec2-interruptible-capacity-reservations",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "cd631391710869d198af7889727d5448ca2bdc4b",
      "title": "AWS IoT Core now supports IoT thing registry data retrieval from IoT rules",
      "summary": "AWS IoT Core has introduced a new get_registry_data() inline rule function that allows IoT rules to dynamically retrieve device information from the IoT thing registry, including attributes, device types, and group membership. This enhancement enables better filtering, enrichment, and routing of IoT messages by leveraging registry data directly within rule processing. The capability is particularly useful for scenarios like filtering connectivity lifecycle events based on device attributes stored in the registry.",
      "category": "COMPUTE",
      "timestamp": "2025-11-24T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/aws-iot-core-thing-registry-data-retrieval/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "f3cc3587b2fe631928079c0da55efe5dd6a98933",
      "title": "AWS Elemental MediaTailor now supports HLS Interstitials for live streams",
      "summary": "AWS Elemental MediaTailor now supports HLS Interstitials for live streams, allowing broadcasters and streaming providers to insert personalized advertisements and promotions seamlessly into live content. This new capability uses the HLS Interstitials specification (RFC 8216) and works natively with popular video players like HLS.js, Shaka Player, and Bitmovin.",
      "category": "OTHER",
      "timestamp": "2025-11-24T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/aws-elemental-mediatailor-hls-interstitials-live-streams",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "26a65386727f1ea05da96ae0ffcaf84dc9613abd",
      "title": "Amazon Redshift now supports federated permissions across multi-warehouse architectures",
      "summary": "Amazon Redshift has introduced federated permissions to simplify permission management across multi-warehouse architectures. This new feature allows customers to define data permissions once from any Redshift warehouse and automatically apply them across multiple warehouses, addressing the need for consistent access control as organizations scale and isolate workloads. The capability streamlines permissions management for customers using distributed Redshift deployments.",
      "category": "DATABASE",
      "timestamp": "2025-11-24T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-redshift-federated-permissions-multi-warehouse-architectures",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "d9ad530194a5e6ea97433ec2b57f53a7b53cd56e",
      "title": "Amazon U7i instances now available in Asia Pacific (Jakarta) Region",
      "summary": "Amazon EC2 U7i instances with 6TB of memory are now available in the Asia Pacific (Jakarta) region, powered by custom 4th generation Intel Xeon Scalable Processors. These high-memory instances feature 448 vCPUs and DDR5 memory, designed to enhance transaction processing throughput for data-intensive workloads.",
      "category": "COMPUTE",
      "timestamp": "2025-11-24T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-u7i-instances-asia-pacific-jakarta-region",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "c95be189c99678f7fb9c4f6ef6a9a3ea86a4a848",
      "title": "Amazon Connect flow modules now support custom inputs, outputs, and version management",
      "summary": "Amazon Connect flow modules now support custom inputs, outputs, and branches, enabling more flexible and reusable business logic components. Users can create modules like authentication systems that accept parameters (phone number, PIN) and return results (customer name, status) with conditional branches. The update also includes version and alias management capabilities for better module governance.",
      "category": "OTHER",
      "timestamp": "2025-11-24T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-connect-flow-modules-custom-inputs-outputs-version-management",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "7b9f333fa0ec3815434db890391797201e72f039",
      "title": "AWS Glue announces catalog federation for remote Apache Iceberg catalogs",
      "summary": "AWS Glue now offers general availability of catalog federation for remote Apache Iceberg catalogs, enabling direct and secure access to Iceberg tables stored in Amazon S3 through AWS analytics engines. This feature allows users to query remote Iceberg tables without moving or copying data, while synchronizing metadata in real-time between AWS Glue Data Catalog and remote catalogs.",
      "category": "SECURITY",
      "timestamp": "2025-11-24T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/aws-glue-catalog-federation-remote-apache-iceberg-catalogs",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "ab883faa78f93f27cda7e83d61fa4a27876f15e5",
      "title": "Amazon Quick Suite Embedded Chat is now available",
      "summary": "AWS has launched Amazon Quick Suite Embedded Chat, allowing developers to integrate conversational AI capabilities directly into their applications without building chat interfaces from scratch. The service combines structured and unstructured data in conversations, solving the problem of users needing to switch between different tools to get answers. This enables businesses to provide AI-powered chat functionality within their existing applications where users are already working.",
      "category": "SECURITY",
      "timestamp": "2025-11-24T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-quick-suite-embedded-chat",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "6ea5d84a4aea860fb01e7ec07b9bf11c94ea8537",
      "title": "Amazon MSK Replicator is now available in five additional AWS Regions",
      "summary": "Amazon MSK Replicator, a feature that enables reliable data replication across Amazon MSK clusters, is now available in five additional AWS Regions: Asia Pacific (Thailand), Mexico (Central), Asia Pacific (Taipei), Canada West (Calgary), and Europe (Spain). This expansion allows customers in these regions to easily replicate streaming data across Amazon Managed Streaming for Apache Kafka clusters with just a few clicks.",
      "category": "ANALYTICS",
      "timestamp": "2025-11-24T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-msk-replicator-additional-aws-regions",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "c741ff8579f55c8a4897803a1131c2ff4ef76a5e",
      "title": "AWS Lambda announces enhanced error handling capabilities for Kafka event processing",
      "summary": "AWS Lambda has introduced enhanced error handling capabilities for both Amazon Managed Streaming for Apache Kafka (MSK) and self-managed Apache Kafka event sources. These new features enable customers to create custom retry configurations, optimize failed message retries, and route failed events to designated Kafka topics as on-failure destinations. This enhancement allows developers to build more resilient Kafka workloads with improved error handling strategies through Lambda's event source mappings.",
      "category": "SERVERLESS",
      "timestamp": "2025-11-24T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/aws-lambda-enhanced-error-handling-capabilities-kafka-event-processing",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "68a5518d833b37ac32d8d63282770e931ff3882e",
      "title": "Claude Opus 4.5 now available in Amazon Bedrock",
      "summary": "AWS has made Claude Opus 4.5 available through Amazon Bedrock, Anthropic's newest model that delivers advanced AI capabilities for coding, workflows, and office tasks at one-third the cost of previous Opus models. The model achieves state-of-the-art performance on software engineering benchmarks like SWE-bench and excels at professional development tasks. This integration allows AWS customers to access Opus-level intelligence through Bedrock's fully managed foundation model service.",
      "category": "AI_ML",
      "timestamp": "2025-11-24T15:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/claude-opus-4-5-amazon-bedrock",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "80e78d545767d26049c4ed647fe50c51dd0159c0",
      "title": "Amazon OpenSearch Service now supports OpenSearch version 3.3",
      "summary": "Amazon OpenSearch Service now supports OpenSearch version 3.3, which delivers enhanced search performance, improved observability, and new functionality designed to simplify agentic AI integrations. A key feature is agentic search, which allows users to achieve precise search results using natural language inputs instead of complex domain-specific language (DSL) queries, along with improved vector search capabilities.",
      "category": "ANALYTICS",
      "timestamp": "2025-11-24T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-opensearch-service-opensearch-version-3-3/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "c56b6df466da04cb64790b95807d0048ca34915f",
      "title": "Amazon Aurora PostgreSQL introduces dynamic data masking",
      "summary": "Amazon Aurora PostgreSQL now supports dynamic data masking through the new pg_columnmask extension, enabling simplified protection of sensitive database information. This feature provides column-level data protection that works alongside PostgreSQL's existing row-level security and column grants. Users can implement SQL-based masking policies to control how sensitive data appears to different users without modifying the underlying data.",
      "category": "SECURITY",
      "timestamp": "2025-11-24T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-aurora-postgresql-dynamic-data-masking",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "b532f866f1d215681f5f5ac27d709010bd9196ef",
      "title": "Amazon SageMaker HyperPod now supports Spot Instances ",
      "summary": "Amazon SageMaker HyperPod now supports Spot Instances, allowing customers to reduce GPU compute costs by up to 90% compared to on-demand instances. This integration enables organizations to automatically leverage spare EC2 capacity at significant discounts while maintaining HyperPod's managed AI experience. The feature addresses the critical need for cost optimization as AI workloads continue to scale.",
      "category": "AI_ML",
      "timestamp": "2025-11-24T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-sagemaker-hyperpod-spot-instances",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "794ff6cc47c449aa17aeeec4d9637d957340c5ed",
      "title": "Amazon SageMaker HyperPod now supports NVIDIA Multi-Instance GPU (MIG) for generative AI tasks",
      "summary": "Amazon SageMaker HyperPod now supports NVIDIA Multi-Instance GPU (MIG) technology, which allows administrators to partition a single GPU into multiple isolated instances. This enhancement enables better resource utilization by running multiple small generative AI tasks simultaneously on the same GPU while maintaining performance isolation between tasks.",
      "category": "AI_ML",
      "timestamp": "2025-11-24T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/sagemaker-hyperpod-nvidia-multi-instance-gpu/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "c250d65329a854d0bff0c505a828c4155d33f211",
      "title": "Amazon CloudFront integrates with VPC IPAM to support BYOIP",
      "summary": "Amazon CloudFront now supports bringing your own IP addresses (BYOIP) through integration with VPC IP Address Manager (IPAM), allowing network administrators to use their own public IPv4 address pools with CloudFront distributions. This new capability provides Anycast Static IPs instead of CloudFront's typical rotating IP addresses, enabling customers to maintain dedicated IP addresses for partners and clients while simplifying IP address management across AWS's global infrastructure.",
      "category": "SECURITY",
      "timestamp": "2025-11-24T08:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/vpc-ipam-cloudfront-byoip",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "32c4a6323a4632fb5540eaa6c1ff8a19b8ef5006",
      "title": "Amazon EMR Serverless now supports Apache Spark 4.0.1 (preview)",
      "summary": "Amazon EMR Serverless now offers preview support for Apache Spark 4.0.1, bringing enhanced features like ANSI SQL support, VARIANT data types, and improved streaming capabilities. The update includes Apache Iceberg v3 table format for better compliance and governance, enabling teams to build data pipelines more easily while reducing technical debt and ensuring data accuracy.",
      "category": "ANALYTICS",
      "timestamp": "2025-11-21T22:50:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-emr-serverless-apache-spark/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "44402527d9ba96c589f32ec8cf33f719682dd395",
      "title": "Amazon Athena for Apache Spark is now available in Amazon SageMaker notebooks",
      "summary": "Amazon SageMaker now integrates Amazon Athena for Apache Spark, providing a unified serverless workspace where data engineers, analysts, and data scientists can query data, run Python code, develop jobs, train models, and visualize data without managing infrastructure. The integration offers second-level billing and scales in seconds to handle workloads ranging from interactive queries to petabyte-scale processing.",
      "category": "AI_ML",
      "timestamp": "2025-11-21T21:40:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-athena-apache-spark-sagemaker-notebooks/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "c32cde872ee97d129d2128dde4175bde32fc8163",
      "title": "AWS Payments Cryptography announces support for post-quantum cryptography to secure data in transit",
      "summary": "AWS Payments Cryptography now supports hybrid post-quantum TLS to secure API calls, allowing customers to protect sensitive data transmissions using ML-KEM post-quantum cryptography. This feature helps enterprises defend against \"harvest now, decrypt later\" attacks, where adversaries could collect encrypted data today and decrypt it once quantum computers become capable enough in the future.",
      "category": "SECURITY",
      "timestamp": "2025-11-21T21:28:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/aws-payments-cryptography-post-quantum-data-transit",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "c19e57f6bf8446546abf51a5159382b6a569c545",
      "title": "AWS Device Farm supports Managed Appium Endpoint and Environment Features",
      "summary": "AWS Device Farm has introduced three new features to enhance web and mobile application testing: a fully-managed Appium endpoint that allows developers to run interactive tests on multiple physical devices directly from their IDE or local environment with minimal code, support for environment variables, and IAM role integration. These capabilities are designed to make it easier for developers to build better web and mobile experiences using real mobile devices and desktop browsers.",
      "category": "SECURITY",
      "timestamp": "2025-11-21T21:08:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/aws-device-farm-managed-appium-endpoint/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "cb2b2385458a08a2eac07181abffc1cdc423f604",
      "title": " EC2 Image Builder now supports auto-versioning and enhances Infrastructure as Code experience",
      "summary": "Amazon EC2 Image Builder now offers automatic versioning for recipes and components, eliminating the need for manual version management and tracking. This enhancement allows users to automatically increment versions and dynamically reference the latest compatible versions in their pipelines. The feature significantly reduces operational overhead and streamlines Infrastructure as Code workflows by removing manual version update requirements.",
      "category": "COMPUTE",
      "timestamp": "2025-11-21T19:35:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/ec2-image-builder-auto-versioning-infrastructure/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "e0ec45af1ac6c193efa842d6347b95e213863280",
      "title": "Automated Reasoning checks now include natural language test Q&A generation",
      "summary": "AWS has launched natural language test Q&A generation for Automated Reasoning checks in Amazon Bedrock Guardrails, which uses formal verification techniques to validate AI model outputs for accuracy and policy compliance. This feature delivers up to 99% accuracy in detecting correct responses from large language models, providing reliable detection of AI hallucinations and helping identify ambiguous model responses.",
      "category": "AI_ML",
      "timestamp": "2025-11-21T18:56:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/automated-reasoning-checks-include-natural-language/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "73029a4978691aa433f020169712e469081c88ee",
      "title": "AWS IoT Core enhances IoT rules-SQL with variable setting and error handling capabilities",
      "summary": "AWS IoT Core has enhanced its IoT rules-SQL with a new SET clause that allows users to set and reuse variables across SQL statements, providing a simpler and more consistent SQL experience. Additionally, a new get_or_default() function has been introduced to improve error handling by returning default values when data encoding or external dependency issues occur, ensuring IoT rules continue executing successfully.",
      "category": "OTHER",
      "timestamp": "2025-11-21T18:38:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/aws-iot-core-rules-sql/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "6b15c7e123125473eae55693e99659b1ee0aa2d0",
      "title": "Amazon Connect launches monitoring of contacts queued for callback",
      "summary": "Amazon Connect has introduced a new feature that allows monitoring of contacts waiting in callback queues. The feature enables searching for queued callback contacts and viewing details like customer phone numbers and queue duration through the Connect UI and APIs. This allows businesses to proactively route at-risk contacts to agents before callback timelines are exceeded and better manage customer expectations.",
      "category": "OTHER",
      "timestamp": "2025-11-21T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-connect-monitoring-contacts-queued-callback/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "81fe9e17652ce61feef16954ff2cbe739949fda7",
      "title": "Aurora DSQL launches new Python, Node.js, and JDBC Connectors that simplify IAM authorization",
      "summary": "AWS has released new Aurora DSQL Connectors for Python, Node.js, and JDBC that simplify IAM authentication when connecting to Aurora DSQL clusters using standard PostgreSQL drivers. These connectors automatically handle IAM token generation, eliminating the need for developers to manually write token generation code or supply IAM tokens. The connectors work transparently with popular PostgreSQL drivers like psycopg and psycopg2 for Python.",
      "category": "SECURITY",
      "timestamp": "2025-11-21T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/aurora-dsql-python-node-js-jdbc-connectors-iam",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "74e8081cf555ce36053bfc3b9b9b846d0c1573a7",
      "title": "Amazon EMR 7.12 now supports the Apache Iceberg v3 table format",
      "summary": "Amazon EMR 7.12 now supports Apache Iceberg v3 table format with version 1.10, enabling more cost-effective data deletion by marking deleted rows instead of rewriting entire files. This update improves data pipeline speed, reduces storage costs, and enhances governance through better row-level change tracking and more granular data access controls.",
      "category": "SECURITY",
      "timestamp": "2025-11-21T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-emr-apache-iceberg-v3-table-format/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "a6fe834323bfc332c08c9844eb6dc26ecf6c244b",
      "title": "Amazon Connect now enables agents to send follow-up replies to email contacts",
      "summary": "Amazon Connect now allows agents to send follow-up email replies to customers while maintaining the original conversation thread and full history. This feature helps agents provide consistent support by preserving context without needing to start new email threads. The capability is available across multiple AWS regions including US East, US West, Africa (Cape Town), and several Asia Pacific locations.",
      "category": "OTHER",
      "timestamp": "2025-11-21T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-connect-enables-agents-send-followup-replies/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "b49391e3508ee10931fcdfde6311fc10f2ecf464",
      "title": "AWS WAF announces Web Bot Auth support",
      "summary": "AWS WAF now supports Web Bot Auth (WBA), a new feature that provides secure authentication for legitimate AI agents and automated tools accessing web applications. This authentication method uses cryptographic signatures in HTTP messages to verify that requests come from authorized bots. The feature is based on active IETF draft standards and offers a standardized approach to distinguishing legitimate automated traffic from potentially malicious bots.",
      "category": "SECURITY",
      "timestamp": "2025-11-21T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/aws-waf-web-bot-auth-support",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "bc0011a22a52bac49bf3fcdf21b7c1ea681dd143",
      "title": "Second-generation AWS Outposts racks now supported in the AWS Asia Pacific (Tokyo) Region",
      "summary": "AWS has expanded support for second-generation Outposts racks to the Asia Pacific (Tokyo) Region, allowing organizations in and around Japan to deploy AWS infrastructure on-premises. This expansion enables companies to meet latency and data residency requirements while maintaining a consistent hybrid cloud experience with AWS services, APIs, and tools.",
      "category": "COMPUTE",
      "timestamp": "2025-11-21T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/second-generation-aws-outposts-racks-asia-pacific-tokyo-region",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "016d49fd4f32d455a51ab00560687ab0e27e04e1",
      "title": "Amazon Aurora DSQL database clusters now support up to 256 TiB of storage volume",
      "summary": "Amazon Aurora DSQL has doubled its maximum storage capacity from 128 TiB to 256 TiB, enabling customers to manage larger datasets within a single database cluster. The service maintains its pay-as-you-use model with automatic storage scaling, eliminating the need for upfront storage provisioning. All Aurora DSQL clusters start with a default 10 TiB storage limit that can be expanded as needed.",
      "category": "DATABASE",
      "timestamp": "2025-11-21T18:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-aurora-dsql-database-clusters-up-to-256-tib",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "c7ca971710ec7e279d764b10be51a696cb90d14a",
      "title": "AWS announces Flexible Cost Allocation on AWS Transit Gateway ",
      "summary": "AWS has announced the general availability of Flexible Cost Allocation (FCA) on AWS Transit Gateway, which provides more versatile options for distributing Transit Gateway costs across organizations. Previously, Transit Gateway only used a sender-pay model where the source attachment account owner paid all data usage costs, but FCA now allows organizations to configure different cost allocation strategies through a central metering policy.",
      "category": "NETWORKING",
      "timestamp": "2025-11-21T17:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/aws-transit-gateway-flexible-cost-allocation/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "c461083361132030f9412ac3f2b9b1cb8f5481ee",
      "title": "Amazon Athena adds cost and performance controls for Capacity Reservations",
      "summary": "Amazon Athena has introduced new cost and performance controls for Capacity Reservations, allowing users to configure Data Processing Unit (DPU) settings at both the workgroup and individual query levels. This feature enables users to balance cost efficiency, concurrency, and performance by setting explicit DPU values for queries running on dedicated serverless processing capacity.",
      "category": "ANALYTICS",
      "timestamp": "2025-11-21T16:39:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-athena-capacity-reservation-controls",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "9a9f313d814876357ef24bebf9f6b83ff8e66863",
      "title": "AWS Security Incident Response now provides agentic AI-powered investigation",
      "summary": "AWS Security Incident Response has introduced an agentic AI-powered investigation feature that automatically collects and correlates evidence from multiple AWS data sources during security events. The AI agent presents findings in clear, actionable summaries to help security teams investigate and respond to incidents more quickly. This capability aims to reduce response times and minimize business disruption from security events.",
      "category": "SECURITY",
      "timestamp": "2025-11-21T16:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/aws-security-incident-response-agentic-ai-powered-investigation",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "246ef929487c13b16d1d927a4ece588b09737bdd",
      "title": "Amazon Location Service introduces Address Form Solution Builder",
      "summary": "AWS has launched Address Form Solution Builder from Amazon Location Service, a no-code tool that allows developers to create customized address forms with predictive suggestions and autofill capabilities. The solution provides a guided experience to generate ready-to-use applications in minutes, with downloadable packages available in React JavaScript, React TypeScript, or Standalone HTML/JavaScript formats.",
      "category": "OTHER",
      "timestamp": "2025-11-21T16:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-location-service-introduces-address-form-builder",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "8ad460d5e5126ccb8175b26ae5db839a1f0784e2",
      "title": "AWS Cost Anomaly Detection accelerates anomaly identification",
      "summary": "AWS Cost Anomaly Detection has upgraded its algorithm to identify unusual spending patterns faster by analyzing costs using rolling 24-hour windows and comparing them against equivalent periods from previous days. The enhanced system processes data each time AWS receives updated cost and usage information, eliminating previous delays in anomaly detection. This improvement addresses common challenges in cost pattern analysis by providing more timely alerts about spending irregularities.",
      "category": "OTHER",
      "timestamp": "2025-11-21T16:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/aws-cost-anomaly-detection-accelerates-anomaly/",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "5b66afa1d149ab5e0ca9051ef7ee247b57447551",
      "title": "AWS Transfer Family announces Terraform module to integrate with a custom identity provider",
      "summary": "AWS Transfer Family has released a new Terraform module that enables automated deployment of Transfer Family endpoints integrated with custom identity providers (IdPs) for authentication and access control. This module allows organizations to streamline the setup of fully-managed file transfer services (SFTP, AS2, FTPS, FTP, and web-based) while leveraging their existing identity management systems through Infrastructure as Code.",
      "category": "SECURITY",
      "timestamp": "2025-11-21T16:00:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/transfer-family-terraform-custom-idp",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "c729def8f6eedec637f1727c1104fed982c492ea",
      "title": "Introducing one-click onboarding of existing datasets to Amazon SageMaker ",
      "summary": "Amazon SageMaker has launched one-click onboarding that allows customers to quickly import their existing AWS datasets into SageMaker Unified Studio using their current IAM roles and permissions. The feature includes a new serverless notebook with a built-in AI agent that supports SQL, Python, Spark, and natural language, enabling data engineers, analysts, and data scientists to start working with their data within minutes.",
      "category": "SECURITY",
      "timestamp": "2025-11-21T15:03:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-sagemaker-one-click-onboarding-existing-datasets",
      "source": "AWS What's New",
      "isNew": false
    },
    {
      "id": "adb99b192e8ab860d59bffb5f66591076dc78baa",
      "title": "Introducing Amazon SageMaker Data Agent for analytics and AI/ML development",
      "summary": "Amazon SageMaker has launched the SageMaker Data Agent, a built-in AI agent available in the new notebook experience within Amazon SageMaker Unified Studio. The agent helps data engineers, analysts, and data scientists by automatically generating code and execution plans from natural language prompts, reducing the time spent on manual setup tasks and boilerplate code. This tool accelerates the development of data analytics and machine learning applications by streamlining the workflow process.",
      "category": "AI_ML",
      "timestamp": "2025-11-21T15:01:00.000Z",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-sagemaker-data-agent-analytics-ai-ml-development",
      "source": "AWS What's New",
      "isNew": false
    }
  ],
  "stats": {
    "total": 230,
    "byCategory": {
      "OTHER": 58,
      "COMPUTE": 32,
      "SECURITY": 54,
      "AI_ML": 41,
      "CONTAINERS": 6,
      "STORAGE": 5,
      "ANALYTICS": 12,
      "DATABASE": 14,
      "NETWORKING": 3,
      "SERVERLESS": 5
    },
    "lastUpdated": "2026-01-08T10:26:14.770Z"
  },
  "generatedAt": "2026-01-08T10:26:14.771Z"
}